var cities = [
    {
        "Id": 1,
        "Name": "A-阿坝"
    },
    {
        "Id": 2,
        "Name": "A-安庆"
    },
    {
        "Id": 3,
        "Name": "B-巴中"
    },
    {
        "Id": 4,
        "Name": "B-蚌埠"
    },
    {
        "Id": 5,
        "Name": "B-宝应"
    },
    {
        "Id": 6,
        "Name": "B-璧山"
    },
    {
        "Id": 7,
        "Name": "B-滨海"
    },
    {
        "Id": 8,
        "Name": "B-滨州"
    },
    {
        "Id": 9,
        "Name": "C-常德"
    },
    {
        "Id": 10,
        "Name": "C-常熟"
    },
    {
        "Id": 11,
        "Name": "C-常州"
    },
    {
        "Id": 12,
        "Name": "C-郴州"
    },
    {
        "Id": 13,
        "Name": "C-成都市区"
    },
    {
        "Id": 14,
        "Name": "C-崇州"
    },
    {
        "Id": 15,
        "Name": "C-滁州"
    },
    {
        "Id": 16,
        "Name": "C-重庆主城区"
    },
    {
        "Id": 17,
        "Name": "D-达州"
    },
    {
        "Id": 18,
        "Name": "D-大邑"
    },
    {
        "Id": 19,
        "Name": "D-大足"
    },
    {
        "Id": 20,
        "Name": "D-丹阳"
    },
    {
        "Id": 21,
        "Name": "D-德阳"
    },
    {
        "Id": 22,
        "Name": "D-德州"
    },
    {
        "Id": 23,
        "Name": "D-东营"
    },
    {
        "Id": 24,
        "Name": "D-都江堰"
    },
    {
        "Id": 25,
        "Name": "F-丰润"
    },
    {
        "Id": 26,
        "Name": "F-阜宁"
    },
    {
        "Id": 27,
        "Name": "F-阜阳"
    },
    {
        "Id": 28,
        "Name": "G-高邮"
    },
    {
        "Id": 29,
        "Name": "G-广元"
    },
    {
        "Id": 30,
        "Name": "H-亳州"
    },
    {
        "Id": 31,
        "Name": "H-海门"
    },
    {
        "Id": 32,
        "Name": "H-合川区"
    },
    {
        "Id": 33,
        "Name": "H-合肥"
    },
    {
        "Id": 34,
        "Name": "H-菏泽"
    },
    {
        "Id": 35,
        "Name": "H-鹤壁"
    },
    {
        "Id": 36,
        "Name": "H-衡阳"
    },
    {
        "Id": 37,
        "Name": "H-洪泽"
    },
    {
        "Id": 38,
        "Name": "H-怀化"
    },
    {
        "Id": 39,
        "Name": "H-淮安市区（含涟水）"
    },
    {
        "Id": 40,
        "Name": "H-淮北"
    },
    {
        "Id": 41,
        "Name": "J-吉首"
    },
    {
        "Id": 42,
        "Name": "J-济宁"
    },
    {
        "Id": 43,
        "Name": "J-建湖"
    },
    {
        "Id": 44,
        "Name": "J-江都"
    },
    {
        "Id": 45,
        "Name": "J-金湖"
    },
    {
        "Id": 46,
        "Name": "J-金坛"
    },
    {
        "Id": 47,
        "Name": "J-金堂"
    },
    {
        "Id": 48,
        "Name": "J-荆门"
    },
    {
        "Id": 49,
        "Name": "J-荆州"
    },
    {
        "Id": 50,
        "Name": "J-靖江"
    },
    {
        "Id": 51,
        "Name": "J-句容"
    },
    {
        "Id": 52,
        "Name": "K-开封"
    },
    {
        "Id": 53,
        "Name": "K-昆山"
    },
    {
        "Id": 54,
        "Name": "L-乐亭"
    },
    {
        "Id": 55,
        "Name": "L-溧阳"
    },
    {
        "Id": 56,
        "Name": "L-连云港"
    },
    {
        "Id": 57,
        "Name": "L-聊城"
    },
    {
        "Id": 58,
        "Name": "L-临沂"
    },
    {
        "Id": 59,
        "Name": "L-六安"
    },
    {
        "Id": 60,
        "Name": "L-龙泉"
    },
    {
        "Id": 61,
        "Name": "L-娄底"
    },
    {
        "Id": 62,
        "Name": "L-滦南"
    },
    {
        "Id": 63,
        "Name": "L-滦县"
    },
    {
        "Id": 64,
        "Name": "L-洛阳"
    },
    {
        "Id": 65,
        "Name": "L-漯河"
    },
    {
        "Id": 66,
        "Name": "M-马鞍山"
    },
    {
        "Id": 67,
        "Name": "M-绵阳"
    },
    {
        "Id": 68,
        "Name": "N-南京头曲和-小酒"
    },
    {
        "Id": 69,
        "Name": "N-南京主城区"
    },
    {
        "Id": 70,
        "Name": "N-南通市区"
    },
    {
        "Id": 71,
        "Name": "N-南阳（不含唐河_新野_内乡）"
    },
    {
        "Id": 72,
        "Name": "N-内乡"
    },
    {
        "Id": 73,
        "Name": "P-彭州"
    },
    {
        "Id": 74,
        "Name": "P-郫县"
    },
    {
        "Id": 75,
        "Name": "P-濮阳"
    },
    {
        "Id": 76,
        "Name": "Q-启东"
    },
    {
        "Id": 77,
        "Name": "Q-迁安"
    },
    {
        "Id": 78,
        "Name": "Q-迁西"
    },
    {
        "Id": 79,
        "Name": "Q-秦皇岛"
    },
    {
        "Id": 80,
        "Name": "Q-青白江"
    },
    {
        "Id": 81,
        "Name": "R-日照"
    },
    {
        "Id": 82,
        "Name": "R-荣昌"
    },
    {
        "Id": 83,
        "Name": "R-如东"
    },
    {
        "Id": 84,
        "Name": "R-如皋"
    },
    {
        "Id": 85,
        "Name": "S-三门峡"
    },
    {
        "Id": 86,
        "Name": "S-邵阳"
    },
    {
        "Id": 87,
        "Name": "S-射阳"
    },
    {
        "Id": 88,
        "Name": "S-双流"
    },
    {
        "Id": 89,
        "Name": "S-苏州"
    },
    {
        "Id": 90,
        "Name": "S-随州"
    },
    {
        "Id": 91,
        "Name": "S-宿迁"
    },
    {
        "Id": 92,
        "Name": "S-宿州"
    },
    {
        "Id": 93,
        "Name": "T-太仓"
    },
    {
        "Id": 94,
        "Name": "T-泰兴"
    },
    {
        "Id": 95,
        "Name": "T-泰州市区（姜堰）"
    },
    {
        "Id": 96,
        "Name": "T-唐河"
    },
    {
        "Id": 97,
        "Name": "T-唐山市区（含丰南-古冶）"
    },
    {
        "Id": 98,
        "Name": "T-铜梁"
    },
    {
        "Id": 99,
        "Name": "T-铜陵"
    },
    {
        "Id": 100,
        "Name": "T-潼南"
    },
    {
        "Id": 101,
        "Name": "W-威海"
    },
    {
        "Id": 102,
        "Name": "W-潍坊"
    },
    {
        "Id": 103,
        "Name": "W-温江"
    },
    {
        "Id": 104,
        "Name": "W-无锡市区"
    },
    {
        "Id": 105,
        "Name": "W-芜湖"
    },
    {
        "Id": 106,
        "Name": "W-武汉"
    },
    {
        "Id": 107,
        "Name": "X-仙天潜"
    },
    {
        "Id": 108,
        "Name": "X-响水"
    },
    {
        "Id": 109,
        "Name": "X-孝感"
    },
    {
        "Id": 110,
        "Name": "X-新都"
    },
    {
        "Id": 111,
        "Name": "X-新津"
    },
    {
        "Id": 112,
        "Name": "X-新乡（含长垣）"
    },
    {
        "Id": 113,
        "Name": "X-新野"
    },
    {
        "Id": 114,
        "Name": "X-信阳"
    },
    {
        "Id": 115,
        "Name": "X-兴化"
    },
    {
        "Id": 116,
        "Name": "X-徐州市区（含丰县-沛县）"
    },
    {
        "Id": 117,
        "Name": "Y-烟台"
    },
    {
        "Id": 118,
        "Name": "Y-盐城市区"
    },
    {
        "Id": 119,
        "Name": "Y-扬中"
    },
    {
        "Id": 120,
        "Name": "Y-扬州市区"
    },
    {
        "Id": 121,
        "Name": "Y-仪征"
    },
    {
        "Id": 122,
        "Name": "Y-益阳"
    },
    {
        "Id": 123,
        "Name": "Y-永川区"
    },
    {
        "Id": 124,
        "Name": "Y-永州"
    },
    {
        "Id": 125,
        "Name": "Y-玉田"
    },
    {
        "Id": 126,
        "Name": "Y-岳阳"
    },
    {
        "Id": 127,
        "Name": "Z-枣庄"
    },
    {
        "Id": 128,
        "Name": "Z-张家港"
    },
    {
        "Id": 129,
        "Name": "Z-张家界"
    },
    {
        "Id": 130,
        "Name": "Z-镇江"
    },
    {
        "Id": 131,
        "Name": "Z-郑州"
    },
    {
        "Id": 132,
        "Name": "Z-周口"
    },
    {
        "Id": 133,
        "Name": "Z-遵化"
    }
];