var dicCodes = [
    {
        "pId": "1",
        "pName": "辽宁",
        "Cities": [
            {
                "cId": "1",
                "cName": "营口市",
                "Dealers": [
                    {
                        "dName": "营口红运汇众汽车销售服务有限公司",
                        "dCode": "1"
                    },
                    {
                        "dName": "营口盛世悦众汽车销售服务有限公司",
                        "dCode": "733"
                    }
                ]
            },
            {
                "cId": "10",
                "cName": "丹东市",
                "Dealers": [
                    {
                        "dName": "丹东曙光汽车贸易有限责任公司",
                        "dCode": "16"
                    }
                ]
            },
            {
                "cId": "6",
                "cName": "沈阳市",
                "Dealers": [
                    {
                        "dName": "沈阳合众汽车服务有限公司",
                        "dCode": "17"
                    },
                    {
                        "dName": "辽宁惠华汽车集团有限公司",
                        "dCode": "212"
                    },
                    {
                        "dName": "辽宁和兴大众汽车销售服务有限公司",
                        "dCode": "214"
                    },
                    {
                        "dName": "沈阳和昊汽车销售服务有限公司",
                        "dCode": "448"
                    },
                    {
                        "dName": "沈阳市庞大一众汽车销售有限公司",
                        "dCode": "585"
                    },
                    {
                        "dName": "沈阳惠华新业汽车销售服务有限公司",
                        "dCode": "696"
                    },
                    {
                        "dName": "辽宁惠华新业集团新民汽车销售服务有限公司",
                        "dCode": "778"
                    },
                    {
                        "dName": "辽宁惠华新业集团辽中汽车销售服务有限公司",
                        "dCode": "879"
                    }
                ]
            },
            {
                "cId": "8",
                "cName": "葫芦岛市",
                "Dealers": [
                    {
                        "dName": "葫芦岛市维立达汽车服务有限公司",
                        "dCode": "18"
                    }
                ]
            },
            {
                "cId": "2",
                "cName": "瓦房店市",
                "Dealers": [
                    {
                        "dName": "瓦房店市顺发物资商贸有限公司",
                        "dCode": "20"
                    }
                ]
            },
            {
                "cId": "9",
                "cName": "阜新市",
                "Dealers": [
                    {
                        "dName": "阜新永生工贸发展有限公司",
                        "dCode": "203"
                    },
                    {
                        "dName": "阜新和利汽车销售服务有限公司",
                        "dCode": "566"
                    }
                ]
            },
            {
                "cId": "7",
                "cName": "锦州市",
                "Dealers": [
                    {
                        "dName": "锦州通用汽车销售服务有限公司",
                        "dCode": "21"
                    }
                ]
            },
            {
                "cId": "11",
                "cName": "大连市",
                "Dealers": [
                    {
                        "dName": "大连汽贸集团汽车销售服务有限公司",
                        "dCode": "215"
                    },
                    {
                        "dName": "大连捷仕达汽车销售服务有限公司",
                        "dCode": "216"
                    },
                    {
                        "dName": "大连通孚祥汽车贸易有限公司",
                        "dCode": "452"
                    },
                    {
                        "dName": "大连禾众汽车销售服务有限公司",
                        "dCode": "743"
                    },
                    {
                        "dName": "大连弘鼎汽车销售服务有限公司",
                        "dCode": "774"
                    }
                ]
            },
            {
                "cId": "12",
                "cName": "鞍山市",
                "Dealers": [
                    {
                        "dName": "鞍山市中田汽车贸易有限公司",
                        "dCode": "217"
                    },
                    {
                        "dName": "鞍山谛赢汽车销售服务有限公司",
                        "dCode": "509"
                    }
                ]
            },
            {
                "cId": "5",
                "cName": "盘锦",
                "Dealers": [
                    {
                        "dName": "盘锦隆达汽车产品销售服务有限公司",
                        "dCode": "281"
                    }
                ]
            },
            {
                "cId": "4",
                "cName": "铁岭市",
                "Dealers": [
                    {
                        "dName": "铁岭市顺峰（集团）汽车销售服务有限公司",
                        "dCode": "383"
                    },
                    {
                        "dName": "铁岭和成汽车销售服务有限公司",
                        "dCode": "567"
                    }
                ]
            },
            {
                "cId": "308",
                "cName": "辽阳市",
                "Dealers": [
                    {
                        "dName": "辽阳凯众汽车销售服务有限公司",
                        "dCode": "517"
                    },
                    {
                        "dName": "灯塔凯祥汽车销售服务有限公司",
                        "dCode": "848"
                    }
                ]
            },
            {
                "cId": "3",
                "cName": "抚顺市",
                "Dealers": [
                    {
                        "dName": "抚顺和昆汽车销售服务有限公司",
                        "dCode": "522"
                    }
                ]
            },
            {
                "cId": "266",
                "cName": "本溪市",
                "Dealers": [
                    {
                        "dName": "辽宁惠华集团本溪汽车销售服务有限公司",
                        "dCode": "608"
                    }
                ]
            },
            {
                "cId": "272",
                "cName": "朝阳市",
                "Dealers": [
                    {
                        "dName": "辽宁惠华集团朝阳汽车销售服务有限公司",
                        "dCode": "627"
                    }
                ]
            }
        ]
    },
    {
        "pId": "28",
        "pName": "云南",
        "Cities": [
            {
                "cId": "185",
                "cName": "昆明市",
                "Dealers": [
                    {
                        "dName": "云南一汽工贸汽车销售服务有限公司",
                        "dCode": "10"
                    },
                    {
                        "dName": "云南云汽汽车销售服务有限公司",
                        "dCode": "122"
                    },
                    {
                        "dName": "云南金鼎汽车贸易有限公司",
                        "dCode": "258"
                    },
                    {
                        "dName": "昆明谊众汽车销售有限公司",
                        "dCode": "286"
                    },
                    {
                        "dName": "昆明捷通达汽车销售有限公司",
                        "dCode": "808"
                    }
                ]
            },
            {
                "cId": "184",
                "cName": "大理市",
                "Dealers": [
                    {
                        "dName": "大理阿鹏有限责任公司",
                        "dCode": "123"
                    }
                ]
            },
            {
                "cId": "188",
                "cName": "保山市",
                "Dealers": [
                    {
                        "dName": "保山联通汽车销售维修有限责任公司",
                        "dCode": "124"
                    }
                ]
            },
            {
                "cId": "187",
                "cName": "安宁市",
                "Dealers": [
                    {
                        "dName": "安宁谊众汽车销售有限公司",
                        "dCode": "193"
                    }
                ]
            },
            {
                "cId": "186",
                "cName": "曲靖市",
                "Dealers": [
                    {
                        "dName": "云南曲靖云鑫工贸有限公司",
                        "dCode": "285"
                    },
                    {
                        "dName": "曲靖宝捷汽车销售有限公司",
                        "dCode": "721"
                    },
                    {
                        "dName": "宣威市添福源汽车贸易有限公司",
                        "dCode": "874"
                    }
                ]
            },
            {
                "cId": "249",
                "cName": "玉溪",
                "Dealers": [
                    {
                        "dName": "玉溪驰瑞汽车销售服务有限公司",
                        "dCode": "583"
                    }
                ]
            },
            {
                "cId": "296",
                "cName": "开远市",
                "Dealers": [
                    {
                        "dName": "红河州鸿云汽车经贸有限公司",
                        "dCode": "692"
                    }
                ]
            },
            {
                "cId": "300",
                "cName": "西双版纳",
                "Dealers": [
                    {
                        "dName": "西双版纳捷成通达汽车销售有限公司",
                        "dCode": "753"
                    }
                ]
            },
            {
                "cId": "305",
                "cName": "昭通市",
                "Dealers": [
                    {
                        "dName": "昭通市恒升汽车服务有限公司",
                        "dCode": "758"
                    }
                ]
            },
            {
                "cId": "310",
                "cName": "德宏州",
                "Dealers": [
                    {
                        "dName": "德宏龙泰通达汽车销售有限公司",
                        "dCode": "779"
                    }
                ]
            },
            {
                "cId": "320",
                "cName": "楚雄市",
                "Dealers": [
                    {
                        "dName": "楚雄易通汽车销售服务有限公司",
                        "dCode": "814"
                    }
                ]
            },
            {
                "cId": "329",
                "cName": "丽江市",
                "Dealers": [
                    {
                        "dName": "丽江恒盛通达汽车销售有限公司",
                        "dCode": "839"
                    }
                ]
            },
            {
                "cId": "318",
                "cName": "文山市",
                "Dealers": [
                    {
                        "dName": "文山捷惠汽车销售服务有限公司",
                        "dCode": "91"
                    }
                ]
            }
        ]
    },
    {
        "pId": "13",
        "pName": "江苏",
        "Cities": [
            {
                "cId": "103",
                "cName": "扬州市",
                "Dealers": [
                    {
                        "dName": "江苏金太阳汽车销售服务有限公司",
                        "dCode": "100"
                    },
                    {
                        "dName": "扬州金沪汽车销售服务有限公司",
                        "dCode": "197"
                    },
                    {
                        "dName": "扬州金通汽车销售服务有限公司",
                        "dCode": "791"
                    },
                    {
                        "dName": "扬州金迈汽车销售服务有限公司",
                        "dCode": "890"
                    }
                ]
            },
            {
                "cId": "91",
                "cName": "常州市",
                "Dealers": [
                    {
                        "dName": "常州国际汽车城有限公司",
                        "dCode": "101"
                    },
                    {
                        "dName": "常州市上瑞汽车销售服务有限公司",
                        "dCode": "563"
                    },
                    {
                        "dName": "溧阳宝达汽车销售服务有限公司",
                        "dCode": "689"
                    },
                    {
                        "dName": "金坛宝达汽车销售服务有限公司",
                        "dCode": "843"
                    },
                    {
                        "dName": "常州外汽东进汽车销售服务有限公司",
                        "dCode": "859"
                    },
                    {
                        "dName": "常州宝达汽车销售服务有限公司",
                        "dCode": "95"
                    }
                ]
            },
            {
                "cId": "104",
                "cName": "镇江市",
                "Dealers": [
                    {
                        "dName": "江苏华跃汽车有限公司",
                        "dCode": "102"
                    },
                    {
                        "dName": "江苏德大汽车有限公司",
                        "dCode": "640"
                    },
                    {
                        "dName": "镇江德豪汽车有限公司",
                        "dCode": "810"
                    }
                ]
            },
            {
                "cId": "102",
                "cName": "南京市",
                "Dealers": [
                    {
                        "dName": "南京协众瑞东汽车有限公司",
                        "dCode": "185"
                    },
                    {
                        "dName": "江苏华海南众汽车销售有限公司",
                        "dCode": "253"
                    },
                    {
                        "dName": "江苏苏舜华德汽车销售服务有限公司",
                        "dCode": "254"
                    },
                    {
                        "dName": "南京协众东麒汽车有限公司",
                        "dCode": "526"
                    },
                    {
                        "dName": "测试经销商",
                        "dCode": "898"
                    },
                    {
                        "dName": "南京协众汽车有限公司",
                        "dCode": "92"
                    },
                    {
                        "dName": "南京朗驰集团苏润汽车销售服务有限公司",
                        "dCode": "97"
                    }
                ]
            },
            {
                "cId": "135",
                "cName": "苏州市",
                "Dealers": [
                    {
                        "dName": "苏州汇凯汽车贸易有限公司",
                        "dCode": "211"
                    },
                    {
                        "dName": "苏州德强汽车销售服务有限公司",
                        "dCode": "384"
                    },
                    {
                        "dName": "苏州市国懋汽车销售服务有限公司",
                        "dCode": "415"
                    },
                    {
                        "dName": "苏州市德宝车业有限公司",
                        "dCode": "534"
                    },
                    {
                        "dName": "苏州德诚汽车销售服务有限公司",
                        "dCode": "883"
                    },
                    {
                        "dName": "张家港市汇众汽车销售有限公司",
                        "dCode": "94"
                    },
                    {
                        "dName": "昆山锦隆汽车贸易有限公司",
                        "dCode": "96"
                    },
                    {
                        "dName": "苏州欧亚伟业实业有限公司",
                        "dCode": "98"
                    }
                ]
            },
            {
                "cId": "176",
                "cName": "无锡市",
                "Dealers": [
                    {
                        "dName": "无锡东方荣昌汽车销售服务有限公司",
                        "dCode": "252"
                    },
                    {
                        "dName": "江阴市全顺海宏汽车销售服务有限公司",
                        "dCode": "449"
                    },
                    {
                        "dName": "宜兴市广海元汽车销售服务有限公司",
                        "dCode": "7"
                    },
                    {
                        "dName": "无锡宝达汽车销售服务有限公司",
                        "dCode": "719"
                    },
                    {
                        "dName": "无锡市新纪元众友汽车销售服务有限公司",
                        "dCode": "8"
                    },
                    {
                        "dName": "宜兴新东方汽车销售服务有限公司",
                        "dCode": "888"
                    },
                    {
                        "dName": "无锡申荣汽车有限公司",
                        "dCode": "89"
                    }
                ]
            },
            {
                "cId": "97",
                "cName": "南通市",
                "Dealers": [
                    {
                        "dName": "南通新城集团有限公司",
                        "dCode": "255"
                    },
                    {
                        "dName": "南通大生众和汽车销售服务有限公司",
                        "dCode": "3"
                    },
                    {
                        "dName": "南通鑫湖汽车贸易服务有限公司",
                        "dCode": "456"
                    },
                    {
                        "dName": "如皋神州汽车销售服务有限公司",
                        "dCode": "684"
                    },
                    {
                        "dName": "南通文峰伟嘉汽车销售服务有限公司",
                        "dCode": "729"
                    },
                    {
                        "dName": "启东常众文峰汽车销售服务有限公司",
                        "dCode": "871"
                    }
                ]
            },
            {
                "cId": "98",
                "cName": "连云港市",
                "Dealers": [
                    {
                        "dName": "连云港康华汽车销售服务有限公司",
                        "dCode": "401"
                    },
                    {
                        "dName": "连云港康瑞汽车销售服务有限公司",
                        "dCode": "795"
                    },
                    {
                        "dName": "连云港康瀛汽车销售有限公司",
                        "dCode": "854"
                    }
                ]
            },
            {
                "cId": "213",
                "cName": "宿迁市",
                "Dealers": [
                    {
                        "dName": "宿迁大中汽车服务有限公司",
                        "dCode": "464"
                    },
                    {
                        "dName": "沭阳大中汽车服务有限公司",
                        "dCode": "853"
                    }
                ]
            },
            {
                "cId": "242",
                "cName": "淮安",
                "Dealers": [
                    {
                        "dName": "淮安康润汽车销售服务有限公司",
                        "dCode": "564"
                    },
                    {
                        "dName": "淮安驰祥汽车销售服务有限公司",
                        "dCode": "67"
                    }
                ]
            },
            {
                "cId": "96",
                "cName": "徐州市",
                "Dealers": [
                    {
                        "dName": "徐州金源汽车服务有限公司",
                        "dCode": "565"
                    },
                    {
                        "dName": "徐州金泉汽车贸易有限公司",
                        "dCode": "786"
                    },
                    {
                        "dName": "徐州金宇汽车贸易有限公司",
                        "dCode": "825"
                    },
                    {
                        "dName": "徐州联和恒顺汽车销售服务有限公司",
                        "dCode": "841"
                    },
                    {
                        "dName": "徐州金茂汽车贸易有限公司",
                        "dCode": "90"
                    }
                ]
            },
            {
                "cId": "276",
                "cName": "泰州市",
                "Dealers": [
                    {
                        "dName": "泰州金太阳汽车贸易有限公司",
                        "dCode": "635"
                    }
                ]
            },
            {
                "cId": "277",
                "cName": "太仓市",
                "Dealers": [
                    {
                        "dName": "太仓市森联汽车销售服务有限公司",
                        "dCode": "636"
                    }
                ]
            },
            {
                "cId": "105",
                "cName": "常熟市",
                "Dealers": [
                    {
                        "dName": "常熟德润汽车销售服务有限公司",
                        "dCode": "744"
                    },
                    {
                        "dName": "常熟市众成汽车销售有限公司",
                        "dCode": "93"
                    }
                ]
            },
            {
                "cId": "101",
                "cName": "盐城市",
                "Dealers": [
                    {
                        "dName": "盐城鑫湖贸易有限公司",
                        "dCode": "797"
                    },
                    {
                        "dName": "东台宝达汽车销售服务有限公司",
                        "dCode": "834"
                    },
                    {
                        "dName": "江苏中联汽车销售服务有限公司",
                        "dCode": "99"
                    }
                ]
            }
        ]
    },
    {
        "pId": "16",
        "pName": "安徽",
        "Cities": [
            {
                "cId": "113",
                "cName": "合肥市",
                "Dealers": [
                    {
                        "dName": "安徽孚迪汽车销售有限公司",
                        "dCode": "103"
                    },
                    {
                        "dName": "安徽宝捷汽车销售服务有限公司",
                        "dCode": "104"
                    },
                    {
                        "dName": "合肥欧亚汽车服务有限公司",
                        "dCode": "535"
                    },
                    {
                        "dName": "安徽众力汽车销售服务有限公司",
                        "dCode": "545"
                    },
                    {
                        "dName": "巢湖亚宝汽车销售服务有限公司",
                        "dCode": "652"
                    }
                ]
            },
            {
                "cId": "116",
                "cName": "芜湖市",
                "Dealers": [
                    {
                        "dName": "芜湖亚夏汽车股份有限公司",
                        "dCode": "105"
                    }
                ]
            },
            {
                "cId": "114",
                "cName": "蚌埠市",
                "Dealers": [
                    {
                        "dName": "蚌埠市华诚轿车销售服务有限公司",
                        "dCode": "106"
                    }
                ]
            },
            {
                "cId": "115",
                "cName": "安庆市",
                "Dealers": [
                    {
                        "dName": "安庆环新汽车摩托车贸易有限公司",
                        "dCode": "15"
                    }
                ]
            },
            {
                "cId": "281",
                "cName": "宣城市",
                "Dealers": [
                    {
                        "dName": "宁国亚宝汽车销售服务有限公司",
                        "dCode": "34"
                    },
                    {
                        "dName": "宣城亚宝汽车销售服务有限公司",
                        "dCode": "653"
                    }
                ]
            },
            {
                "cId": "322",
                "cName": "黄山",
                "Dealers": [
                    {
                        "dName": "黄山亚众汽车销售服务有限公司",
                        "dCode": "36"
                    }
                ]
            },
            {
                "cId": "117",
                "cName": "阜阳市",
                "Dealers": [
                    {
                        "dName": "阜阳市永鑫汽车销售服务有限公司",
                        "dCode": "523"
                    }
                ]
            },
            {
                "cId": "233",
                "cName": "滁州",
                "Dealers": [
                    {
                        "dName": "滁州金通联众汽车销售有限公司",
                        "dCode": "546"
                    }
                ]
            },
            {
                "cId": "280",
                "cName": "毫州市",
                "Dealers": [
                    {
                        "dName": "亳州中源汽车销售服务有限公司",
                        "dCode": "651"
                    }
                ]
            },
            {
                "cId": "284",
                "cName": "宿州市",
                "Dealers": [
                    {
                        "dName": "宿州市丽豪汽车销售服务有限公司",
                        "dCode": "662"
                    }
                ]
            },
            {
                "cId": "285",
                "cName": "马鞍山市",
                "Dealers": [
                    {
                        "dName": "马鞍山协众汽车销售有限公司",
                        "dCode": "663"
                    }
                ]
            },
            {
                "cId": "289",
                "cName": "六安市",
                "Dealers": [
                    {
                        "dName": "六安和众汽车销售服务有限公司",
                        "dCode": "670"
                    }
                ]
            },
            {
                "cId": "297",
                "cName": "铜陵市",
                "Dealers": [
                    {
                        "dName": "铜陵市海达汽车销售服务有限公司",
                        "dCode": "705"
                    }
                ]
            },
            {
                "cId": "314",
                "cName": "淮北市",
                "Dealers": [
                    {
                        "dName": "淮北市运昌汽车销售服务有限责任公司",
                        "dCode": "796"
                    }
                ]
            },
            {
                "cId": "344",
                "cName": "淮南市",
                "Dealers": [
                    {
                        "dName": "淮南盛之杰汽车销售服务有限公司",
                        "dCode": "863"
                    }
                ]
            }
        ]
    },
    {
        "pId": "22",
        "pName": "四川",
        "Cities": [
            {
                "cId": "127",
                "cName": "成都市",
                "Dealers": [
                    {
                        "dName": "四川一汽贸易有限责任公司",
                        "dCode": "107"
                    },
                    {
                        "dName": "成都曙光汽车销售服务有限公司",
                        "dCode": "108"
                    },
                    {
                        "dName": "四川长征汽车贸易有限公司",
                        "dCode": "111"
                    },
                    {
                        "dName": "成都市强生实业有限责任公司",
                        "dCode": "113"
                    },
                    {
                        "dName": "成都启新汽车服务有限责任公司",
                        "dCode": "114"
                    },
                    {
                        "dName": "四川华星大众汽车销售服务有限公司",
                        "dCode": "116"
                    },
                    {
                        "dName": "四川精典吉众汽车销售服务有限公司",
                        "dCode": "256"
                    },
                    {
                        "dName": "东创建国汽车集团成都天弘车业有限公司",
                        "dCode": "459"
                    },
                    {
                        "dName": "四川申蓉和浩汽车销售服务有限公司",
                        "dCode": "519"
                    },
                    {
                        "dName": "成都启阳远航汽车销售服务有限公司",
                        "dCode": "650"
                    },
                    {
                        "dName": "成都宏羽众信汽车销售服务有限公司",
                        "dCode": "686"
                    },
                    {
                        "dName": "成都运通博恩汽车销售有限公司",
                        "dCode": "738"
                    },
                    {
                        "dName": "崇州瑞龙汽车销售服务有限公司",
                        "dCode": "781"
                    },
                    {
                        "dName": "成都广汇申蓉汇通汽车销售服务有限公司",
                        "dCode": "815"
                    },
                    {
                        "dName": "成都汇腾汽车销售服务有限公司",
                        "dCode": "816"
                    },
                    {
                        "dName": "成都汇和汽车销售有限公司",
                        "dCode": "82"
                    },
                    {
                        "dName": "都江堰阔龙汽车销售服务有限公司",
                        "dCode": "828"
                    },
                    {
                        "dName": "四川申蓉雅泰汽车销售服务有限公司",
                        "dCode": "846"
                    }
                ]
            },
            {
                "cId": "132",
                "cName": "攀枝花市",
                "Dealers": [
                    {
                        "dName": "攀枝花市力行工贸有限责任公司",
                        "dCode": "110"
                    }
                ]
            },
            {
                "cId": "130",
                "cName": "绵阳市",
                "Dealers": [
                    {
                        "dName": "绵阳市倍尔轿车服务有限公司",
                        "dCode": "112"
                    },
                    {
                        "dName": "绵阳景鸿汽车销售服务有限公司",
                        "dCode": "722"
                    }
                ]
            },
            {
                "cId": "131",
                "cName": "德阳市",
                "Dealers": [
                    {
                        "dName": "四川德阳川西汽车销售服务有限公司",
                        "dCode": "117"
                    },
                    {
                        "dName": "德阳万路众悦汽车销售服务有限公司",
                        "dCode": "574"
                    },
                    {
                        "dName": "德阳盛鸿汽车销售服务有限公司",
                        "dCode": "693"
                    },
                    {
                        "dName": "四川广汉恒达汽车销售有限公司",
                        "dCode": "860"
                    }
                ]
            },
            {
                "cId": "133",
                "cName": "泸州市",
                "Dealers": [
                    {
                        "dName": "泸州松明汽贸有限公司",
                        "dCode": "119"
                    }
                ]
            },
            {
                "cId": "128",
                "cName": "乐山市",
                "Dealers": [
                    {
                        "dName": "乐山市华茂车业有限责任公司",
                        "dCode": "475"
                    }
                ]
            },
            {
                "cId": "221",
                "cName": "眉山市",
                "Dealers": [
                    {
                        "dName": "四川省眉山市建国汽车有限公司",
                        "dCode": "488"
                    },
                    {
                        "dName": "四川仁寿恒信汽车销售有限公司",
                        "dCode": "802"
                    }
                ]
            },
            {
                "cId": "260",
                "cName": "自贡市",
                "Dealers": [
                    {
                        "dName": "自贡市和众汽车销售服务有限公司",
                        "dCode": "595"
                    }
                ]
            },
            {
                "cId": "268",
                "cName": "达州市",
                "Dealers": [
                    {
                        "dName": "达州市新世纪汽车销售服务有限公司",
                        "dCode": "612"
                    }
                ]
            },
            {
                "cId": "271",
                "cName": "广元市",
                "Dealers": [
                    {
                        "dName": "广元建雄汽车销售服务有限公司",
                        "dCode": "624"
                    }
                ]
            },
            {
                "cId": "129",
                "cName": "南充市",
                "Dealers": [
                    {
                        "dName": "南充明云惠民车业有限公司",
                        "dCode": "728"
                    }
                ]
            },
            {
                "cId": "306",
                "cName": "遂宁市",
                "Dealers": [
                    {
                        "dName": "遂宁市瑞胜汽车销售有限公司",
                        "dCode": "759"
                    }
                ]
            },
            {
                "cId": "326",
                "cName": "内江市",
                "Dealers": [
                    {
                        "dName": "内江瑞龙汽车销售服务有限公司",
                        "dCode": "829"
                    }
                ]
            }
        ]
    },
    {
        "pId": "5",
        "pName": "广东",
        "Cities": [
            {
                "cId": "27",
                "cName": "东莞市",
                "Dealers": [
                    {
                        "dName": "东莞庞大一众汽车销售服务有限公司",
                        "dCode": "109"
                    },
                    {
                        "dName": "东莞市捷达通贸易有限公司",
                        "dCode": "134"
                    },
                    {
                        "dName": "东莞市昌发汽车贸易有限公司",
                        "dCode": "143"
                    },
                    {
                        "dName": "东莞市新大地汽车贸易有限公司",
                        "dCode": "264"
                    },
                    {
                        "dName": "东莞市鸿众汽车销售服务有限公司",
                        "dCode": "645"
                    },
                    {
                        "dName": "东莞市锦众汽车贸易有限公司",
                        "dCode": "646"
                    },
                    {
                        "dName": "东莞市东深奇建汽车销售服务有限公司",
                        "dCode": "794"
                    }
                ]
            },
            {
                "cId": "39",
                "cName": "广州市",
                "Dealers": [
                    {
                        "dName": "广东君乐汽车贸易有限公司",
                        "dCode": "127"
                    },
                    {
                        "dName": "广州市锦众汽车贸易有限公司",
                        "dCode": "137"
                    },
                    {
                        "dName": "广州市梅花园汽车销售服务有限公司",
                        "dCode": "260"
                    },
                    {
                        "dName": "广东物通凯骏汽车有限公司",
                        "dCode": "411"
                    },
                    {
                        "dName": "广州市健稳汽车贸易有限公司",
                        "dCode": "474"
                    },
                    {
                        "dName": "广东物通溢众汽车展销中心有限公司",
                        "dCode": "477"
                    },
                    {
                        "dName": "广州市大吉汽车销售服务有限公司",
                        "dCode": "489"
                    },
                    {
                        "dName": "广州市南菱万众汽车维修服务有限公司",
                        "dCode": "710"
                    },
                    {
                        "dName": "广州庞大一众汽车销售服务有限公司",
                        "dCode": "845"
                    }
                ]
            },
            {
                "cId": "38",
                "cName": "深圳市",
                "Dealers": [
                    {
                        "dName": "深圳市奇建贸易有限公司",
                        "dCode": "128"
                    },
                    {
                        "dName": "深圳市安进汽车贸易有限公司",
                        "dCode": "138"
                    },
                    {
                        "dName": "深圳市昊天林实业有限公司",
                        "dCode": "262"
                    },
                    {
                        "dName": "深圳市南方腾龙汽车销售服务有限公司",
                        "dCode": "507"
                    },
                    {
                        "dName": "深圳市北奇建贸易有限公司",
                        "dCode": "726"
                    },
                    {
                        "dName": "深圳市清水河奇建贸易有限公司",
                        "dCode": "878"
                    }
                ]
            },
            {
                "cId": "35",
                "cName": "珠海市",
                "Dealers": [
                    {
                        "dName": "珠海市珠光汽车有限公司",
                        "dCode": "129"
                    },
                    {
                        "dName": "珠海市香洲一汽汽车销售有限公司",
                        "dCode": "263"
                    }
                ]
            },
            {
                "cId": "36",
                "cName": "中山市",
                "Dealers": [
                    {
                        "dName": "中山市创世纪汽车有限公司",
                        "dCode": "132"
                    },
                    {
                        "dName": "中山市众腾汽车有限公司",
                        "dCode": "664"
                    }
                ]
            },
            {
                "cId": "32",
                "cName": "惠州市",
                "Dealers": [
                    {
                        "dName": "惠州市大众汽车销售服务有限公司",
                        "dCode": "135"
                    },
                    {
                        "dName": "惠州市志通恒泰汽车销售服务有限公司",
                        "dCode": "679"
                    }
                ]
            },
            {
                "cId": "41",
                "cName": "潮州市",
                "Dealers": [
                    {
                        "dName": "潮州市通达汽车贸易有限公司",
                        "dCode": "136"
                    }
                ]
            },
            {
                "cId": "33",
                "cName": "江门市",
                "Dealers": [
                    {
                        "dName": "江门市新众汽车销售服务有限公司",
                        "dCode": "139"
                    },
                    {
                        "dName": "江门市钜荣汽车销售服务有限公司",
                        "dCode": "57"
                    }
                ]
            },
            {
                "cId": "34",
                "cName": "汕头市",
                "Dealers": [
                    {
                        "dName": "汕头市裕丰交通经济发展有限公司",
                        "dCode": "140"
                    },
                    {
                        "dName": "汕头市庞大一众汽车销售服务有限公司",
                        "dCode": "876"
                    }
                ]
            },
            {
                "cId": "40",
                "cName": "佛山市",
                "Dealers": [
                    {
                        "dName": "佛山市合诚汽车销售服务有限公司",
                        "dCode": "141"
                    },
                    {
                        "dName": "佛山市顺德区世锦汽车贸易有限公司",
                        "dCode": "142"
                    },
                    {
                        "dName": "佛山市南海区拓华汽车贸易有限公司",
                        "dCode": "266"
                    },
                    {
                        "dName": "佛山市英丰汽车销售服务有限公司",
                        "dCode": "654"
                    },
                    {
                        "dName": "佛山市瀚众汽车贸易服务有限公司",
                        "dCode": "736"
                    }
                ]
            },
            {
                "cId": "28",
                "cName": "韶关市",
                "Dealers": [
                    {
                        "dName": "韶关市亿华汽车贸易有限公司",
                        "dCode": "145"
                    }
                ]
            },
            {
                "cId": "31",
                "cName": "茂名市",
                "Dealers": [
                    {
                        "dName": "茂名市茂南茂汉汽车贸易有限公司",
                        "dCode": "265"
                    }
                ]
            },
            {
                "cId": "37",
                "cName": "湛江市",
                "Dealers": [
                    {
                        "dName": "湛江市正日汽车贸易有限公司",
                        "dCode": "368"
                    }
                ]
            },
            {
                "cId": "236",
                "cName": "清远",
                "Dealers": [
                    {
                        "dName": "清远南方合众汽车销售服务有限公司",
                        "dCode": "553"
                    }
                ]
            },
            {
                "cId": "30",
                "cName": "揭阳市",
                "Dealers": [
                    {
                        "dName": "揭阳合和汽车销售服务有限公司",
                        "dCode": "655"
                    }
                ]
            },
            {
                "cId": "283",
                "cName": "河源市",
                "Dealers": [
                    {
                        "dName": "河源市德宝汽车贸易有限公司",
                        "dCode": "659"
                    }
                ]
            },
            {
                "cId": "286",
                "cName": "梅州市",
                "Dealers": [
                    {
                        "dName": "梅州市新宇汽车销售服务有限公司",
                        "dCode": "665"
                    }
                ]
            },
            {
                "cId": "29",
                "cName": "肇庆市",
                "Dealers": [
                    {
                        "dName": "肇庆市安迅汽车有限公司",
                        "dCode": "680"
                    }
                ]
            },
            {
                "cId": "301",
                "cName": "阳江市",
                "Dealers": [
                    {
                        "dName": "阳江安捷源众汽车销售服务有限公司",
                        "dCode": "754"
                    }
                ]
            },
            {
                "cId": "348",
                "cName": "汕尾",
                "Dealers": [
                    {
                        "dName": "汕尾市君乐汽车销售服务有限公司",
                        "dCode": "877"
                    }
                ]
            }
        ]
    },
    {
        "pId": "20",
        "pName": "陕西",
        "Cities": [
            {
                "cId": "311",
                "cName": "渭南市",
                "Dealers": [
                    {
                        "dName": "渭南佳燕汽车贸易有限公司",
                        "dCode": "11"
                    }
                ]
            },
            {
                "cId": "125",
                "cName": "榆林市",
                "Dealers": [
                    {
                        "dName": "府谷县恒捷汽贸有限公司",
                        "dCode": "131"
                    },
                    {
                        "dName": "榆林市恒丰汽贸有限公司",
                        "dCode": "151"
                    },
                    {
                        "dName": "榆林市恒源汽贸有限公司",
                        "dCode": "511"
                    },
                    {
                        "dName": "神木县恒捷汽贸有限公司",
                        "dCode": "735"
                    },
                    {
                        "dName": "靖边县恒博汽贸有限公司",
                        "dCode": "807"
                    }
                ]
            },
            {
                "cId": "123",
                "cName": "西安市",
                "Dealers": [
                    {
                        "dName": "陕西东明汽车商行有限公司",
                        "dCode": "152"
                    },
                    {
                        "dName": "陕西鹰之杰汽车贸易有限公司",
                        "dCode": "153"
                    },
                    {
                        "dName": "西安秦川唐都机电汽车配件销售有限公司",
                        "dCode": "269"
                    },
                    {
                        "dName": "陕西百佳汽车贸易有限公司",
                        "dCode": "406"
                    },
                    {
                        "dName": "陕西天一汽车销售服务有限责任公司",
                        "dCode": "458"
                    },
                    {
                        "dName": "西安新白云汽车销售服务有限公司",
                        "dCode": "671"
                    }
                ]
            },
            {
                "cId": "124",
                "cName": "延安市",
                "Dealers": [
                    {
                        "dName": "延安市宝塔区黄泰有限责任公司",
                        "dCode": "154"
                    }
                ]
            },
            {
                "cId": "324",
                "cName": "铜川市",
                "Dealers": [
                    {
                        "dName": "铜川新区黄泰汽车销售服务有限责任公司",
                        "dCode": "390"
                    }
                ]
            },
            {
                "cId": "245",
                "cName": "安康",
                "Dealers": [
                    {
                        "dName": "安康市庞大一众汽车销售有限公司",
                        "dCode": "572"
                    }
                ]
            },
            {
                "cId": "261",
                "cName": "宝鸡市",
                "Dealers": [
                    {
                        "dName": "宝鸡市宝众汽车销售服务有限公司",
                        "dCode": "592"
                    }
                ]
            },
            {
                "cId": "288",
                "cName": "汉中市",
                "Dealers": [
                    {
                        "dName": "汉中博通汽车销售服务有限公司",
                        "dCode": "667"
                    }
                ]
            },
            {
                "cId": "299",
                "cName": "咸阳市",
                "Dealers": [
                    {
                        "dName": "咸阳恒丰汽贸有限公司",
                        "dCode": "752"
                    }
                ]
            },
            {
                "cId": "307",
                "cName": "韩城市",
                "Dealers": [
                    {
                        "dName": "韩城市众瑞汽车销售有限责任公司",
                        "dCode": "769"
                    }
                ]
            }
        ]
    },
    {
        "pId": "23",
        "pName": "山西",
        "Cities": [
            {
                "cId": "246",
                "cName": "阳泉",
                "Dealers": [
                    {
                        "dName": "盂县鑫众汽车销售有限公司",
                        "dCode": "115"
                    },
                    {
                        "dName": "阳泉市庞大一众汽车销售有限公司",
                        "dCode": "573"
                    }
                ]
            },
            {
                "cId": "137",
                "cName": "运城市",
                "Dealers": [
                    {
                        "dName": "山西诺维兰集团运城瑞众汽车销售服务有限公司",
                        "dCode": "230"
                    },
                    {
                        "dName": "运城市通达汽车销售服务有限公司",
                        "dCode": "328"
                    },
                    {
                        "dName": "山西诺维兰集团河津市瑞腾汽车销售服务有限公司",
                        "dCode": "892"
                    }
                ]
            },
            {
                "cId": "143",
                "cName": "忻州市",
                "Dealers": [
                    {
                        "dName": "山西信鹏汽车销售服务有限公司",
                        "dCode": "325"
                    }
                ]
            },
            {
                "cId": "136",
                "cName": "朔州市",
                "Dealers": [
                    {
                        "dName": "朔州市双良汽车有限公司",
                        "dCode": "326"
                    }
                ]
            },
            {
                "cId": "141",
                "cName": "太原市",
                "Dealers": [
                    {
                        "dName": "山西中汽贸联汽车销售有限公司",
                        "dCode": "327"
                    },
                    {
                        "dName": "山西志国星赛车发展有限公司",
                        "dCode": "333"
                    },
                    {
                        "dName": "山西大昌轿车销售服务有限公司",
                        "dCode": "335"
                    },
                    {
                        "dName": "山西大昌通源汽车销售服务有限公司",
                        "dCode": "701"
                    }
                ]
            },
            {
                "cId": "134",
                "cName": "大同市",
                "Dealers": [
                    {
                        "dName": "大同市谷氏车城汽车连锁销售有限公司",
                        "dCode": "329"
                    },
                    {
                        "dName": "庞大大同南郊一众汽车销售有限公司",
                        "dCode": "658"
                    }
                ]
            },
            {
                "cId": "138",
                "cName": "长治市",
                "Dealers": [
                    {
                        "dName": "山西省长治市飞路汽车贸易有限公司",
                        "dCode": "330"
                    },
                    {
                        "dName": "长治市中天汽车销售服务有限公司",
                        "dCode": "589"
                    }
                ]
            },
            {
                "cId": "140",
                "cName": "晋中市",
                "Dealers": [
                    {
                        "dName": "晋中航成轿车销售服务有限公司",
                        "dCode": "331"
                    }
                ]
            },
            {
                "cId": "142",
                "cName": "晋城市",
                "Dealers": [
                    {
                        "dName": "晋城市唐荣实业有限公司",
                        "dCode": "332"
                    }
                ]
            },
            {
                "cId": "265",
                "cName": "吕梁市",
                "Dealers": [
                    {
                        "dName": "山西吕梁大昌众达汽车服务有限公司",
                        "dCode": "606"
                    }
                ]
            },
            {
                "cId": "139",
                "cName": "临汾市",
                "Dealers": [
                    {
                        "dName": "临汾天健国风汽车销售服务有限公司",
                        "dCode": "867"
                    }
                ]
            }
        ]
    },
    {
        "pId": "8",
        "pName": "河北",
        "Cities": [
            {
                "cId": "57",
                "cName": "唐山市",
                "Dealers": [
                    {
                        "dName": "乐亭县荣川朗基伦汽车销售有限公司",
                        "dCode": "118"
                    },
                    {
                        "dName": "唐山市冀东汽车销售有限公司",
                        "dCode": "40"
                    },
                    {
                        "dName": "唐山市庞大一众汽车销售有限公司",
                        "dCode": "598"
                    },
                    {
                        "dName": "迁安市庞大一众汽车销售有限公司",
                        "dCode": "619"
                    },
                    {
                        "dName": "唐山朗基伦汽车销售有限公司",
                        "dCode": "647"
                    },
                    {
                        "dName": "滦县庞大一众汽车销售有限公司",
                        "dCode": "687"
                    },
                    {
                        "dName": "唐山市庞大众跃汽车销售服务有限公司",
                        "dCode": "741"
                    },
                    {
                        "dName": "滦南荣川朗基伦汽车销售有限公司",
                        "dCode": "766"
                    },
                    {
                        "dName": "玉田县庞大一众汽车销售有限公司",
                        "dCode": "884"
                    }
                ]
            },
            {
                "cId": "56",
                "cName": "邢台市",
                "Dealers": [
                    {
                        "dName": "清河县惠龙汽车销售服务有限公司",
                        "dCode": "174"
                    },
                    {
                        "dName": "邢台亿龙汽车销售服务有限公司",
                        "dCode": "39"
                    },
                    {
                        "dName": "邢台瑞龙汽车服务有限公司",
                        "dCode": "556"
                    },
                    {
                        "dName": "邢台阔龙汽车销售服务有限公司",
                        "dCode": "793"
                    }
                ]
            },
            {
                "cId": "63",
                "cName": "沧州市",
                "Dealers": [
                    {
                        "dName": "沧州市瑞华汽车贸易有限公司",
                        "dCode": "19"
                    },
                    {
                        "dName": "黄骅市前进汽车服务有限公司",
                        "dCode": "340"
                    },
                    {
                        "dName": "沧州运通汽车销售服务有限公司",
                        "dCode": "389"
                    },
                    {
                        "dName": "沧州庞大一众汽车销售有限公司",
                        "dCode": "742"
                    },
                    {
                        "dName": "泊头市运东汽车销售服务有限公司",
                        "dCode": "857"
                    }
                ]
            },
            {
                "cId": "61",
                "cName": "石家庄市",
                "Dealers": [
                    {
                        "dName": "河北世纪汽车贸易有限公司",
                        "dCode": "226"
                    },
                    {
                        "dName": "石家庄市冀中汽车贸易有限公司",
                        "dCode": "227"
                    },
                    {
                        "dName": "河北众捷汽车贸易有限公司",
                        "dCode": "38"
                    },
                    {
                        "dName": "石家庄晨阳汽车贸易有限公司",
                        "dCode": "44"
                    },
                    {
                        "dName": "石家庄市庞大一众汽车销售有限公司",
                        "dCode": "639"
                    },
                    {
                        "dName": "石家庄晨阳和众汽车贸易有限公司",
                        "dCode": "770"
                    },
                    {
                        "dName": "石家庄晨阳博众汽车贸易有限公司",
                        "dCode": "830"
                    },
                    {
                        "dName": "石家庄晨阳汇众汽车贸易有限公司",
                        "dCode": "880"
                    },
                    {
                        "dName": "石家庄晨阳详云汽车贸易有限公司",
                        "dCode": "881"
                    },
                    {
                        "dName": "辛集市车是客汽车贸易有限公司",
                        "dCode": "882"
                    }
                ]
            },
            {
                "cId": "60",
                "cName": "廊坊市",
                "Dealers": [
                    {
                        "dName": "廊坊市冀东汽车销售有限公司",
                        "dCode": "228"
                    },
                    {
                        "dName": "三河巨丰弘迪汽车维修服务有限公司",
                        "dCode": "695"
                    },
                    {
                        "dName": "廊坊市庞大一众汽车销售服务有限公司",
                        "dCode": "740"
                    },
                    {
                        "dName": "大城县亿龙汽车销售有限公司",
                        "dCode": "823"
                    },
                    {
                        "dName": "霸州市云海汽车销售服务有限公司",
                        "dCode": "866"
                    }
                ]
            },
            {
                "cId": "59",
                "cName": "秦皇岛市",
                "Dealers": [
                    {
                        "dName": "秦皇岛新源汽车销售维修有限公司",
                        "dCode": "231"
                    },
                    {
                        "dName": "秦皇岛市庞大一众汽车销售有限公司",
                        "dCode": "444"
                    },
                    {
                        "dName": "青龙满族自治县庞大一众汽车销售有限公司",
                        "dCode": "765"
                    }
                ]
            },
            {
                "cId": "62",
                "cName": "邯郸市",
                "Dealers": [
                    {
                        "dName": "邯郸市顺达汽车贸易有限公司",
                        "dCode": "292"
                    },
                    {
                        "dName": "邯郸市华信泰达汽车贸易有限公司",
                        "dCode": "356"
                    },
                    {
                        "dName": "邯郸市华迈汽车销售服务有限公司",
                        "dCode": "496"
                    },
                    {
                        "dName": "邯郸市帅祺汽车贸易有限公司",
                        "dCode": "749"
                    },
                    {
                        "dName": "邯郸市华信进贤汽车贸易有限公司",
                        "dCode": "799"
                    },
                    {
                        "dName": "邯郸市华锦汽车销售服务有限公司",
                        "dCode": "819"
                    },
                    {
                        "dName": "永年县瑞龙汽车销售服务有限公司",
                        "dCode": "861"
                    }
                ]
            },
            {
                "cId": "54",
                "cName": "保定市",
                "Dealers": [
                    {
                        "dName": "高碑店市新海轿车销售有限公司",
                        "dCode": "346"
                    },
                    {
                        "dName": "保定轩宇俊鹏汽车销售服务有限公司",
                        "dCode": "387"
                    },
                    {
                        "dName": "保定市中冀汽车贸易集团有限公司",
                        "dCode": "43"
                    },
                    {
                        "dName": "保定市耀达正博汽车销售服务有限公司",
                        "dCode": "56"
                    },
                    {
                        "dName": "保定市朗尊汽车销售服务有限公司",
                        "dCode": "675"
                    }
                ]
            },
            {
                "cId": "58",
                "cName": "任丘市",
                "Dealers": [
                    {
                        "dName": "任丘市瑞丰建筑有限公司",
                        "dCode": "388"
                    }
                ]
            },
            {
                "cId": "64",
                "cName": "衡水市",
                "Dealers": [
                    {
                        "dName": "衡水烨通汽贸有限公司",
                        "dCode": "391"
                    },
                    {
                        "dName": "衡水瑞龙汽车销售服务有限公司",
                        "dCode": "716"
                    },
                    {
                        "dName": "衡水恒德安发汽车销售有限公司",
                        "dCode": "767"
                    },
                    {
                        "dName": "衡水阔龙汽车销售服务有限公司",
                        "dCode": "817"
                    }
                ]
            },
            {
                "cId": "207",
                "cName": "张家口市",
                "Dealers": [
                    {
                        "dName": "张家口市庞大一众汽车销售有限公司",
                        "dCode": "446"
                    },
                    {
                        "dName": "张家口市庞大众腾汽车销售有限公司",
                        "dCode": "893"
                    }
                ]
            },
            {
                "cId": "206",
                "cName": "承德市",
                "Dealers": [
                    {
                        "dName": "承德市庞大一众汽车销售有限公司",
                        "dCode": "485"
                    }
                ]
            },
            {
                "cId": "237",
                "cName": "遵化",
                "Dealers": [
                    {
                        "dName": "遵化市庞大一众汽车销售有限公司",
                        "dCode": "555"
                    }
                ]
            },
            {
                "cId": "323",
                "cName": "定州",
                "Dealers": [
                    {
                        "dName": "定州轩宇俊鹏汽车销售服务有限公司",
                        "dCode": "826"
                    }
                ]
            },
            {
                "cId": "327",
                "cName": "河间市",
                "Dealers": [
                    {
                        "dName": "河间市润众达汽车销售服务有限公司",
                        "dCode": "831"
                    }
                ]
            }
        ]
    },
    {
        "pId": "24",
        "pName": "山东",
        "Cities": [
            {
                "cId": "162",
                "cName": "临沂市",
                "Dealers": [
                    {
                        "dName": "沂南大华汽车销售服务有限公司",
                        "dCode": "12"
                    },
                    {
                        "dName": "沂水大华汽车销售服务有限公司",
                        "dCode": "13"
                    },
                    {
                        "dName": "临沂大华汽车销售服务有限公司",
                        "dCode": "234"
                    },
                    {
                        "dName": "平邑大华汽车销售服务有限公司",
                        "dCode": "41"
                    },
                    {
                        "dName": "临沂佳轮汽车销售服务有限公司",
                        "dCode": "53"
                    },
                    {
                        "dName": "临沂东华汽车销售服务有限公司",
                        "dCode": "569"
                    },
                    {
                        "dName": "临沂久华汽车销售服务有限公司",
                        "dCode": "690"
                    },
                    {
                        "dName": "苍山大华汽车销售服务有限公司",
                        "dCode": "697"
                    },
                    {
                        "dName": "临沭东华汽车销售服务有限公司",
                        "dCode": "698"
                    },
                    {
                        "dName": "费县大华汽车销售服务有限公司",
                        "dCode": "699"
                    },
                    {
                        "dName": "郯城大华汽车销售服务有限公司",
                        "dCode": "764"
                    }
                ]
            },
            {
                "cId": "164",
                "cName": "日照市",
                "Dealers": [
                    {
                        "dName": "莒县众合汽车销售服务有限公司",
                        "dCode": "133"
                    },
                    {
                        "dName": "日照市众达汽车销售服务有限公司",
                        "dCode": "66"
                    },
                    {
                        "dName": "日照市腾达众晟汽车销售服务有限公司",
                        "dCode": "685"
                    }
                ]
            },
            {
                "cId": "163",
                "cName": "青岛市",
                "Dealers": [
                    {
                        "dName": "青岛迪生源汽车销售服务有限公司",
                        "dCode": "204"
                    },
                    {
                        "dName": "青岛庞大一众汽车销售有限公司",
                        "dCode": "334"
                    },
                    {
                        "dName": "青岛亨通汽车销售服务有限公司",
                        "dCode": "416"
                    },
                    {
                        "dName": "青岛大栏汽车销售有限公司",
                        "dCode": "55"
                    },
                    {
                        "dName": "青岛华世通实业发展有限公司",
                        "dCode": "6"
                    },
                    {
                        "dName": "青岛莱西市瑞富春汽车销售服务有限公司",
                        "dCode": "768"
                    }
                ]
            },
            {
                "cId": "150",
                "cName": "诸城市",
                "Dealers": [
                    {
                        "dName": "诸城市永邦汽车服务有限公司",
                        "dCode": "210"
                    }
                ]
            },
            {
                "cId": "152",
                "cName": "泰安市",
                "Dealers": [
                    {
                        "dName": "泰安中租汽车贸易有限公司",
                        "dCode": "235"
                    },
                    {
                        "dName": "泰安仁博汽车销售有限公司",
                        "dCode": "734"
                    },
                    {
                        "dName": "肥城市创伟汽车服务有限公司",
                        "dCode": "849"
                    }
                ]
            },
            {
                "cId": "154",
                "cName": "烟台市",
                "Dealers": [
                    {
                        "dName": "烟台东联汽车销售有限公司",
                        "dCode": "282"
                    },
                    {
                        "dName": "烟台市大成汽车销售有限公司",
                        "dCode": "48"
                    },
                    {
                        "dName": "海阳市瑞富春汽车销售服务有限公司",
                        "dCode": "730"
                    }
                ]
            },
            {
                "cId": "158",
                "cName": "济宁市",
                "Dealers": [
                    {
                        "dName": "济宁市长济汽车贸易有限公司",
                        "dCode": "283"
                    },
                    {
                        "dName": "济宁众诚汽车销售服务有限公司",
                        "dCode": "463"
                    },
                    {
                        "dName": "济宁世盛汽车销售服务有限公司",
                        "dCode": "720"
                    },
                    {
                        "dName": "济宁交运怡丰汽车销售服务有限公司",
                        "dCode": "837"
                    }
                ]
            },
            {
                "cId": "151",
                "cName": "淄博市",
                "Dealers": [
                    {
                        "dName": "淄博市久期汽车销售有限公司",
                        "dCode": "358"
                    },
                    {
                        "dName": "淄博唯达长齐汽车销售有限公司",
                        "dCode": "571"
                    },
                    {
                        "dName": "淄博众信汽车销售服务有限公司",
                        "dCode": "62"
                    },
                    {
                        "dName": "淄博骏泰汽车销售服务有限公司",
                        "dCode": "704"
                    }
                ]
            },
            {
                "cId": "160",
                "cName": "莱州市",
                "Dealers": [
                    {
                        "dName": "莱州市鸿富汽车经销有限公司",
                        "dCode": "4"
                    }
                ]
            },
            {
                "cId": "210",
                "cName": "青州市",
                "Dealers": [
                    {
                        "dName": "青州宝悦汽车销售服务有限公司",
                        "dCode": "457"
                    }
                ]
            },
            {
                "cId": "146",
                "cName": "济南市",
                "Dealers": [
                    {
                        "dName": "山东润捷汽车销售服务有限公司",
                        "dCode": "46"
                    },
                    {
                        "dName": "山东首佳汽车销售服务有限公司",
                        "dCode": "480"
                    },
                    {
                        "dName": "山东银座汽车贸易有限公司",
                        "dCode": "49"
                    },
                    {
                        "dName": "山东金宝利汽车销售服务有限公司",
                        "dCode": "527"
                    },
                    {
                        "dName": "济南庞大一众汽车销售服务有限公司",
                        "dCode": "784"
                    }
                ]
            },
            {
                "cId": "214",
                "cName": "新泰市",
                "Dealers": [
                    {
                        "dName": "新泰市创新汽车服务有限公司",
                        "dCode": "465"
                    }
                ]
            },
            {
                "cId": "145",
                "cName": "龙口市",
                "Dealers": [
                    {
                        "dName": "山东龙口富龙汽车有限公司",
                        "dCode": "47"
                    }
                ]
            },
            {
                "cId": "165",
                "cName": "威海市",
                "Dealers": [
                    {
                        "dName": "威海康利隆汽车销售服务有限公司",
                        "dCode": "479"
                    },
                    {
                        "dName": "荣成市众奥达汽车销售服务有限公司",
                        "dCode": "691"
                    },
                    {
                        "dName": "乳山中升汇众汽车销售服务有限公司",
                        "dCode": "886"
                    }
                ]
            },
            {
                "cId": "156",
                "cName": "东营市",
                "Dealers": [
                    {
                        "dName": "东营华锐汽车销售有限公司",
                        "dCode": "491"
                    }
                ]
            },
            {
                "cId": "155",
                "cName": "滨州市",
                "Dealers": [
                    {
                        "dName": "山东滨州宝捷汽车销售服务有限公司",
                        "dCode": "5"
                    },
                    {
                        "dName": "滨州腾翔汽车销售服务有限公司",
                        "dCode": "590"
                    },
                    {
                        "dName": "山东无棣腾翔汽车销售服务有限公司",
                        "dCode": "763"
                    },
                    {
                        "dName": "滨州泰通汽车销售服务有限公司",
                        "dCode": "856"
                    }
                ]
            },
            {
                "cId": "147",
                "cName": "菏泽市",
                "Dealers": [
                    {
                        "dName": "菏泽交通集团有限公司",
                        "dCode": "51"
                    },
                    {
                        "dName": "菏泽金江车业有限公司",
                        "dCode": "780"
                    }
                ]
            },
            {
                "cId": "157",
                "cName": "高密市",
                "Dealers": [
                    {
                        "dName": "高密市经贸汽车销售有限公司",
                        "dCode": "52"
                    }
                ]
            },
            {
                "cId": "144",
                "cName": "德州市",
                "Dealers": [
                    {
                        "dName": "德州汇众汽车销售技术服务有限公司",
                        "dCode": "54"
                    },
                    {
                        "dName": "德州华运汽贸销售服务有限公司",
                        "dCode": "69"
                    },
                    {
                        "dName": "夏津汇达汽车销售有限公司",
                        "dCode": "832"
                    }
                ]
            },
            {
                "cId": "244",
                "cName": "寿光",
                "Dealers": [
                    {
                        "dName": "寿光富泓汽车销售服务有限公司",
                        "dCode": "570"
                    }
                ]
            },
            {
                "cId": "148",
                "cName": "潍坊市",
                "Dealers": [
                    {
                        "dName": "潍坊市鑫达汽车贸易有限公司",
                        "dCode": "58"
                    },
                    {
                        "dName": "潍坊广潍发达商贸有限公司",
                        "dCode": "61"
                    },
                    {
                        "dName": "临朐广潍顺达汽车销售服务有限公司",
                        "dCode": "703"
                    },
                    {
                        "dName": "昌邑广潍金达汽车销售服务有限公司",
                        "dCode": "887"
                    }
                ]
            },
            {
                "cId": "159",
                "cName": "莱芜市",
                "Dealers": [
                    {
                        "dName": "莱芜泰通汽车销售服务有限公司",
                        "dCode": "59"
                    }
                ]
            },
            {
                "cId": "259",
                "cName": "滕州市",
                "Dealers": [
                    {
                        "dName": "山东永正集团东联汽车城有限公司",
                        "dCode": "591"
                    }
                ]
            },
            {
                "cId": "161",
                "cName": "聊城市",
                "Dealers": [
                    {
                        "dName": "聊城交运集团汽车销售服务有限责任公司",
                        "dCode": "60"
                    },
                    {
                        "dName": "聊城北斗泰众汽车销售有限公司",
                        "dCode": "637"
                    },
                    {
                        "dName": "茌平德众汽车销售服务有限公司",
                        "dCode": "827"
                    }
                ]
            },
            {
                "cId": "149",
                "cName": "招远市",
                "Dealers": [
                    {
                        "dName": "招远市天城汽车维修有限公司",
                        "dCode": "63"
                    }
                ]
            },
            {
                "cId": "257",
                "cName": "莱阳市",
                "Dealers": [
                    {
                        "dName": "烟台瑞源汽车销售有限公司",
                        "dCode": "64"
                    }
                ]
            },
            {
                "cId": "258",
                "cName": "枣庄市",
                "Dealers": [
                    {
                        "dName": "山东东联汽车经贸有限公司",
                        "dCode": "68"
                    }
                ]
            },
            {
                "cId": "315",
                "cName": "齐河市",
                "Dealers": [
                    {
                        "dName": "齐河华腾汽车销售有限公司",
                        "dCode": "800"
                    }
                ]
            },
            {
                "cId": "325",
                "cName": "乐陵市",
                "Dealers": [
                    {
                        "dName": "乐陵市鑫众汽车销售服务有限公司",
                        "dCode": "824"
                    }
                ]
            }
        ]
    },
    {
        "pId": "6",
        "pName": "贵州",
        "Cities": [
            {
                "cId": "42",
                "cName": "贵阳市",
                "Dealers": [
                    {
                        "dName": "贵州利和汽车贸易有限公司",
                        "dCode": "120"
                    },
                    {
                        "dName": "贵州四扬汽车销售服务有限公司",
                        "dCode": "121"
                    },
                    {
                        "dName": "贵州汽车修理公司",
                        "dCode": "257"
                    }
                ]
            },
            {
                "cId": "317",
                "cName": "凯里市",
                "Dealers": [
                    {
                        "dName": "凯里恒信众联汽车销售服务有限公司",
                        "dCode": "31"
                    }
                ]
            },
            {
                "cId": "291",
                "cName": "兴义市",
                "Dealers": [
                    {
                        "dName": "兴义市恒信众联汽车销售服务有限公司",
                        "dCode": "678"
                    }
                ]
            },
            {
                "cId": "43",
                "cName": "遵义市",
                "Dealers": [
                    {
                        "dName": "遵义市千汇汽车销售服务有限公司",
                        "dCode": "727"
                    },
                    {
                        "dName": "遵义华来金汽车贸易有限公司",
                        "dCode": "9"
                    }
                ]
            },
            {
                "cId": "316",
                "cName": "安顺市",
                "Dealers": [
                    {
                        "dName": "安顺恒信众联汽车销售服务有限公司",
                        "dCode": "803"
                    }
                ]
            },
            {
                "cId": "346",
                "cName": "六盘水市",
                "Dealers": [
                    {
                        "dName": "六盘水和通汽车销售服务有限公司",
                        "dCode": "868"
                    }
                ]
            },
            {
                "cId": "349",
                "cName": "铜仁市",
                "Dealers": [
                    {
                        "dName": "铜仁恒信众联汽车销售服务有限公司",
                        "dCode": "885"
                    }
                ]
            }
        ]
    },
    {
        "pId": "17",
        "pName": "重庆",
        "Cities": [
            {
                "cId": "118",
                "cName": "重庆市",
                "Dealers": [
                    {
                        "dName": "重庆商社汽车贸易有限公司",
                        "dCode": "125"
                    },
                    {
                        "dName": "重庆龙华实业集团众友汽车销售服务有限公司",
                        "dCode": "126"
                    },
                    {
                        "dName": "重庆百事达华博汽车销售服务有限公司",
                        "dCode": "521"
                    },
                    {
                        "dName": "重庆龙华实业集团众华汽车销售服务有限公司",
                        "dCode": "625"
                    },
                    {
                        "dName": "重庆龙华实业集团协众汽车销售服务有限公司",
                        "dCode": "714"
                    },
                    {
                        "dName": "重庆盛驰汽车有限公司",
                        "dCode": "838"
                    },
                    {
                        "dName": "重庆百事达华驰汽车销售服务有限公司",
                        "dCode": "895"
                    }
                ]
            }
        ]
    },
    {
        "pId": "19",
        "pName": "新疆",
        "Cities": [
            {
                "cId": "120",
                "cName": "乌鲁木齐市",
                "Dealers": [
                    {
                        "dName": "乌鲁木齐庞大腾众汽车销售有限公司",
                        "dCode": "130"
                    },
                    {
                        "dName": "新疆天汇华宇汽车销售服务有限责任公司",
                        "dCode": "159"
                    },
                    {
                        "dName": "新疆汇捷汽车销售服务有限责任公司",
                        "dCode": "160"
                    },
                    {
                        "dName": "新疆庞大一众汽车销售服务有限公司",
                        "dCode": "424"
                    }
                ]
            },
            {
                "cId": "121",
                "cName": "阿克苏市",
                "Dealers": [
                    {
                        "dName": "阿克苏振宇汽车销售有限责任公司",
                        "dCode": "162"
                    }
                ]
            },
            {
                "cId": "217",
                "cName": "哈密市",
                "Dealers": [
                    {
                        "dName": "哈密庞大一众汽车销售服务有限公司",
                        "dCode": "483"
                    }
                ]
            },
            {
                "cId": "218",
                "cName": "喀什市",
                "Dealers": [
                    {
                        "dName": "喀什庞大一众汽车销售服务有限公司",
                        "dCode": "484"
                    }
                ]
            },
            {
                "cId": "219",
                "cName": "库尔勒",
                "Dealers": [
                    {
                        "dName": "库尔勒庞大一众汽车销售服务有限公司",
                        "dCode": "487"
                    }
                ]
            },
            {
                "cId": "269",
                "cName": "昌吉市",
                "Dealers": [
                    {
                        "dName": "昌吉市庞大一众汽车销售服务有限公司",
                        "dCode": "613"
                    }
                ]
            },
            {
                "cId": "122",
                "cName": "克拉玛依市",
                "Dealers": [
                    {
                        "dName": "克拉玛依庞大一众汽车销售服务有限公司",
                        "dCode": "614"
                    }
                ]
            }
        ]
    },
    {
        "pId": "15",
        "pName": "北京",
        "Cities": [
            {
                "cId": "112",
                "cName": "北京市",
                "Dealers": [
                    {
                        "dName": "北京华信宏业商贸有限公司",
                        "dCode": "14"
                    },
                    {
                        "dName": "北京华昌汽车销售服务有限公司",
                        "dCode": "184"
                    },
                    {
                        "dName": "北京庆洋汽车服务有限公司",
                        "dCode": "188"
                    },
                    {
                        "dName": "北京运通博恩汽车销售服务有限公司",
                        "dCode": "190"
                    },
                    {
                        "dName": "北京硕川汽车销售服务有限公司",
                        "dCode": "191"
                    },
                    {
                        "dName": "北京友联威科汽车销售服务有限公司",
                        "dCode": "194"
                    },
                    {
                        "dName": "北京首汽腾鹏汽车销售服务有限公司",
                        "dCode": "196"
                    },
                    {
                        "dName": "北京冀东丰汽车销售服务有限公司",
                        "dCode": "198"
                    },
                    {
                        "dName": "北京市天达汽车修理有限公司",
                        "dCode": "199"
                    },
                    {
                        "dName": "北京德奥达一众汽车销售有限公司",
                        "dCode": "206"
                    },
                    {
                        "dName": "北京东仁金舆汽车销售服务有限公司",
                        "dCode": "209"
                    },
                    {
                        "dName": "北京亚之杰伯乐汽车销售服务有限公司",
                        "dCode": "272"
                    },
                    {
                        "dName": "北京拓展工贸发展有限公司",
                        "dCode": "273"
                    },
                    {
                        "dName": "北京捷亚泰汽贸有限公司",
                        "dCode": "274"
                    },
                    {
                        "dName": "北京海联力通经贸有限公司",
                        "dCode": "275"
                    },
                    {
                        "dName": "北京骏宝威汽车贸易有限公司",
                        "dCode": "276"
                    },
                    {
                        "dName": "北京北方华驿车辆销售服务有限公司",
                        "dCode": "277"
                    },
                    {
                        "dName": "北京东方华正汽车销售服务有限公司",
                        "dCode": "278"
                    },
                    {
                        "dName": "北京市良乡万达工贸有限公司",
                        "dCode": "288"
                    },
                    {
                        "dName": "北京汽车贸易中心有限公司",
                        "dCode": "374"
                    },
                    {
                        "dName": "大众汽车服务中心（北京）有限公司",
                        "dCode": "382"
                    },
                    {
                        "dName": "北京鑫万维汽车经贸有限公司",
                        "dCode": "414"
                    },
                    {
                        "dName": "北京捷亚泰中盛汽车销售有限公司",
                        "dCode": "547"
                    },
                    {
                        "dName": "北京鑫万维富达汽车销售有限公司",
                        "dCode": "548"
                    },
                    {
                        "dName": "北京捷亚泰中兴汽车销售有限公司",
                        "dCode": "604"
                    },
                    {
                        "dName": "北京联拓通达汽车销售服务有限公司",
                        "dCode": "605"
                    },
                    {
                        "dName": "北京博瑞祥泰汽车销售服务有限公司",
                        "dCode": "616"
                    },
                    {
                        "dName": "北京博瑞祥恒汽车销售有限公司",
                        "dCode": "617"
                    },
                    {
                        "dName": "北京博瑞祥弘汽车销售服务有限公司",
                        "dCode": "618"
                    },
                    {
                        "dName": "北京上地四方汽车销售服务有限公司",
                        "dCode": "626"
                    },
                    {
                        "dName": "北京运通兴恩汽车销售服务有限公司",
                        "dCode": "673"
                    },
                    {
                        "dName": "北京捷亚泰万兴汽车销售有限公司",
                        "dCode": "676"
                    },
                    {
                        "dName": "北京庆洋惠众汽车服务有限公司",
                        "dCode": "715"
                    },
                    {
                        "dName": "北京海联力捷汽车销售服务有限公司",
                        "dCode": "717"
                    },
                    {
                        "dName": "北京长久博众汽车销售服务有限公司",
                        "dCode": "739"
                    },
                    {
                        "dName": "北京运通嘉恩汽车销售服务有限公司",
                        "dCode": "785"
                    },
                    {
                        "dName": "北京联拓亿众汽车服务有限公司",
                        "dCode": "789"
                    }
                ]
            }
        ]
    },
    {
        "pId": "9",
        "pName": "黑龙江",
        "Cities": [
            {
                "cId": "67",
                "cName": "佳木斯",
                "Dealers": [
                    {
                        "dName": "富锦安诚汽车销售服务有限公司",
                        "dCode": "144"
                    },
                    {
                        "dName": "佳木斯安诚轿车销售服务有限公司",
                        "dCode": "35"
                    }
                ]
            },
            {
                "cId": "331",
                "cName": "伊春市",
                "Dealers": [
                    {
                        "dName": "伊春龙海德众汽车销售有限公司",
                        "dCode": "148"
                    }
                ]
            },
            {
                "cId": "330",
                "cName": "双鸭山市",
                "Dealers": [
                    {
                        "dName": "双鸭山安诚汽车销售服务有限公司",
                        "dCode": "167"
                    }
                ]
            },
            {
                "cId": "66",
                "cName": "鸡西市",
                "Dealers": [
                    {
                        "dName": "鸡西市英华进口汽车服务有限公司",
                        "dCode": "2"
                    }
                ]
            },
            {
                "cId": "65",
                "cName": "哈尔滨市",
                "Dealers": [
                    {
                        "dName": "哈尔滨中汽汽贸汽车销售服务有限公司",
                        "dCode": "223"
                    },
                    {
                        "dName": "黑龙江龙海汽车销售集团有限公司",
                        "dCode": "224"
                    },
                    {
                        "dName": "哈尔滨一汽森华汽车贸易有限公司",
                        "dCode": "29"
                    },
                    {
                        "dName": "黑龙江博远汽车维修有限公司",
                        "dCode": "33"
                    },
                    {
                        "dName": "黑龙江运通俊业汽车销售服务有限公司",
                        "dCode": "385"
                    },
                    {
                        "dName": "哈尔滨诚杰汽车销售有限公司",
                        "dCode": "760"
                    }
                ]
            },
            {
                "cId": "68",
                "cName": "牡丹江市",
                "Dealers": [
                    {
                        "dName": "牡丹江中信汽车销售服务有限责任公司",
                        "dCode": "225"
                    }
                ]
            },
            {
                "cId": "69",
                "cName": "齐齐哈尔市",
                "Dealers": [
                    {
                        "dName": "齐齐哈尔粤华轿车销售有限公司",
                        "dCode": "37"
                    },
                    {
                        "dName": "齐齐哈尔华明晟通汽车销售有限公司",
                        "dCode": "840"
                    }
                ]
            },
            {
                "cId": "70",
                "cName": "大庆市",
                "Dealers": [
                    {
                        "dName": "大庆世腾汽车销售有限公司",
                        "dCode": "492"
                    },
                    {
                        "dName": "大庆世腾骏兴汽车销售服务有限公司",
                        "dCode": "609"
                    }
                ]
            },
            {
                "cId": "292",
                "cName": "绥化市",
                "Dealers": [
                    {
                        "dName": "黑龙江龙众汽车销售服务有限公司",
                        "dCode": "682"
                    }
                ]
            },
            {
                "cId": "313",
                "cName": "鹤岗市",
                "Dealers": [
                    {
                        "dName": "鹤岗骏达汽车销售有限公司",
                        "dCode": "788"
                    }
                ]
            },
            {
                "cId": "332",
                "cName": "大兴安岭地区",
                "Dealers": [
                    {
                        "dName": "大兴安岭龙海兴众汽车销售服务有限公司",
                        "dCode": "842"
                    }
                ]
            }
        ]
    },
    {
        "pId": "4",
        "pName": "广西",
        "Cities": [
            {
                "cId": "24",
                "cName": "南宁市",
                "Dealers": [
                    {
                        "dName": "广西弘捷汽车销售服务有限公司",
                        "dCode": "146"
                    },
                    {
                        "dName": "广西鑫广达长久汽车商贸有限公司",
                        "dCode": "268"
                    },
                    {
                        "dName": "广西鑫广达博冠汽车销售服务有限公司",
                        "dCode": "870"
                    }
                ]
            },
            {
                "cId": "26",
                "cName": "柳州市",
                "Dealers": [
                    {
                        "dName": "柳州市盛铭汽车贸易有限公司",
                        "dCode": "147"
                    },
                    {
                        "dName": "柳州鑫广达博腾汽车销售服务有限公司",
                        "dCode": "84"
                    }
                ]
            },
            {
                "cId": "25",
                "cName": "桂林市",
                "Dealers": [
                    {
                        "dName": "桂林鑫广达汽车销售服务有限责任公司",
                        "dCode": "379"
                    }
                ]
            },
            {
                "cId": "223",
                "cName": "玉林市",
                "Dealers": [
                    {
                        "dName": "玉林市弘标汽车销售服务有限公司",
                        "dCode": "476"
                    }
                ]
            },
            {
                "cId": "302",
                "cName": "贵港市",
                "Dealers": [
                    {
                        "dName": "贵港市弘捷汽车销售服务有限公司",
                        "dCode": "755"
                    }
                ]
            },
            {
                "cId": "304",
                "cName": "河池市",
                "Dealers": [
                    {
                        "dName": "河池市弘捷汽车销售服务有限公司",
                        "dCode": "757"
                    }
                ]
            }
        ]
    },
    {
        "pId": "26",
        "pName": "西藏",
        "Cities": [
            {
                "cId": "167",
                "cName": "拉萨市",
                "Dealers": [
                    {
                        "dName": "拉萨康达汽贸有限责任公司",
                        "dCode": "149"
                    },
                    {
                        "dName": "拉萨康达汽贸有限责任公司",
                        "dCode": "575"
                    }
                ]
            }
        ]
    },
    {
        "pId": "7",
        "pName": "河南",
        "Cities": [
            {
                "cId": "52",
                "cName": "郑州市",
                "Dealers": [
                    {
                        "dName": "郑州庞大一众汽车销售有限公司",
                        "dCode": "150"
                    },
                    {
                        "dName": "河南裕华奥捷汽车销售服务有限公司",
                        "dCode": "170"
                    },
                    {
                        "dName": "河南豫港华翔汽车销售服务有限公司",
                        "dCode": "349"
                    },
                    {
                        "dName": "河南合众汇金实业有限公司",
                        "dCode": "372"
                    },
                    {
                        "dName": "河南万通一汽贸易有限公司",
                        "dCode": "405"
                    },
                    {
                        "dName": "河南润众实业有限公司",
                        "dCode": "524"
                    },
                    {
                        "dName": "河南合众明德汽车销售服务有限公司",
                        "dCode": "688"
                    },
                    {
                        "dName": "郑州东佳汽车销售服务有限责任公司",
                        "dCode": "894"
                    }
                ]
            },
            {
                "cId": "47",
                "cName": "濮阳市",
                "Dealers": [
                    {
                        "dName": "濮阳市宝捷汽车销售服务有限公司",
                        "dCode": "171"
                    }
                ]
            },
            {
                "cId": "253",
                "cName": "商丘市",
                "Dealers": [
                    {
                        "dName": "商丘市众捷汽车销售有限公司",
                        "dCode": "232"
                    },
                    {
                        "dName": "永城市华瑞汽车销售有限公司",
                        "dCode": "801"
                    },
                    {
                        "dName": "虞城县众捷汽车贸易物流有限公司",
                        "dCode": "851"
                    }
                ]
            },
            {
                "cId": "46",
                "cName": "新乡市",
                "Dealers": [
                    {
                        "dName": "新乡市世通汽车贸易有限责任公司",
                        "dCode": "310"
                    },
                    {
                        "dName": "新乡市坤丰汽车销售有限公司",
                        "dCode": "42"
                    },
                    {
                        "dName": "长垣世通汽车贸易有限公司",
                        "dCode": "775"
                    },
                    {
                        "dName": "辉县市世通汽车销售有限公司",
                        "dCode": "850"
                    }
                ]
            },
            {
                "cId": "48",
                "cName": "漯河市",
                "Dealers": [
                    {
                        "dName": "漯河市宝捷汽车销售服务有限公司",
                        "dCode": "319"
                    }
                ]
            },
            {
                "cId": "44",
                "cName": "安阳市",
                "Dealers": [
                    {
                        "dName": "安阳市宝捷汽车贸易有限责任公司",
                        "dCode": "320"
                    },
                    {
                        "dName": "安阳市世达汽车销售服务有限公司",
                        "dCode": "798"
                    },
                    {
                        "dName": "滑县锦程汽车销售服务有限公司",
                        "dCode": "833"
                    }
                ]
            },
            {
                "cId": "45",
                "cName": "许昌市",
                "Dealers": [
                    {
                        "dName": "许昌恒业汽车销售有限公司",
                        "dCode": "350"
                    },
                    {
                        "dName": "长葛市恒业汽车销售有限公司",
                        "dCode": "889"
                    }
                ]
            },
            {
                "cId": "50",
                "cName": "开封市",
                "Dealers": [
                    {
                        "dName": "开封市万宝汽车贸易有限公司",
                        "dCode": "351"
                    },
                    {
                        "dName": "开封万宝汽车销售服务有限公司",
                        "dCode": "865"
                    }
                ]
            },
            {
                "cId": "51",
                "cName": "焦作市",
                "Dealers": [
                    {
                        "dName": "焦作市云洲汽车贸易有限公司",
                        "dCode": "402"
                    }
                ]
            },
            {
                "cId": "49",
                "cName": "洛阳市",
                "Dealers": [
                    {
                        "dName": "洛阳伯乐汽车有限公司",
                        "dCode": "404"
                    },
                    {
                        "dName": "洛阳开元汽车销售服务有限公司",
                        "dCode": "772"
                    },
                    {
                        "dName": "洛阳盛业汽车有限公司",
                        "dCode": "777"
                    },
                    {
                        "dName": "洛阳吉众汽车有限公司",
                        "dCode": "869"
                    }
                ]
            },
            {
                "cId": "238",
                "cName": "周口",
                "Dealers": [
                    {
                        "dName": "周口市和荣汽车销售服务有限公司",
                        "dCode": "557"
                    }
                ]
            },
            {
                "cId": "53",
                "cName": "南阳市",
                "Dealers": [
                    {
                        "dName": "南阳众业汽车有限公司",
                        "dCode": "559"
                    }
                ]
            },
            {
                "cId": "240",
                "cName": "平顶山",
                "Dealers": [
                    {
                        "dName": "平顶山市华天汽车销售服务有限公司",
                        "dCode": "560"
                    },
                    {
                        "dName": "平顶山吉祥地汽车销售有限公司",
                        "dCode": "821"
                    }
                ]
            },
            {
                "cId": "239",
                "cName": "驻马店",
                "Dealers": [
                    {
                        "dName": "驻马店市和美汽车销售服务有限公司",
                        "dCode": "582"
                    }
                ]
            },
            {
                "cId": "274",
                "cName": "三门峡市",
                "Dealers": [
                    {
                        "dName": "三门峡九都汽车有限公司",
                        "dCode": "629"
                    }
                ]
            },
            {
                "cId": "278",
                "cName": "信阳市",
                "Dealers": [
                    {
                        "dName": "信阳合众汇金汽车销售服务有限公司",
                        "dCode": "644"
                    }
                ]
            },
            {
                "cId": "298",
                "cName": "鹤壁市",
                "Dealers": [
                    {
                        "dName": "鹤壁维尔娜汽车销售有限公司",
                        "dCode": "751"
                    }
                ]
            }
        ]
    },
    {
        "pId": "2",
        "pName": "甘肃",
        "Cities": [
            {
                "cId": "13",
                "cName": "兰州市",
                "Dealers": [
                    {
                        "dName": "兰州金岛汽车销售有限公司",
                        "dCode": "155"
                    },
                    {
                        "dName": "兰州庞大一众汽车销售服务有限公司",
                        "dCode": "423"
                    },
                    {
                        "dName": "兰州新纪元汽车销售服务有限公司",
                        "dCode": "709"
                    },
                    {
                        "dName": "兰州金盛强汽车销售有限公司",
                        "dCode": "745"
                    }
                ]
            },
            {
                "cId": "14",
                "cName": "嘉峪关市",
                "Dealers": [
                    {
                        "dName": "甘肃友好汽车服务有限责任公司",
                        "dCode": "156"
                    }
                ]
            },
            {
                "cId": "264",
                "cName": "白银",
                "Dealers": [
                    {
                        "dName": "白银庞大一众汽车销售服务有限公司",
                        "dCode": "445"
                    }
                ]
            },
            {
                "cId": "328",
                "cName": "金昌市",
                "Dealers": [
                    {
                        "dName": "金昌赛亚汇通汽车销售服务有限公司",
                        "dCode": "836"
                    }
                ]
            },
            {
                "cId": "333",
                "cName": "酒泉市",
                "Dealers": [
                    {
                        "dName": "酒泉金岛汽车销售服务有限公司",
                        "dCode": "847"
                    }
                ]
            }
        ]
    },
    {
        "pId": "18",
        "pName": "青海",
        "Cities": [
            {
                "cId": "119",
                "cName": "西宁市",
                "Dealers": [
                    {
                        "dName": "青海海通汽车贸易有限公司",
                        "dCode": "157"
                    },
                    {
                        "dName": "青海通瑞汽车贸易有限公司",
                        "dCode": "634"
                    }
                ]
            },
            {
                "cId": "319",
                "cName": "格尔木市",
                "Dealers": [
                    {
                        "dName": "格尔木宝瑞通汽车贸易有限公司",
                        "dCode": "809"
                    }
                ]
            }
        ]
    },
    {
        "pId": "30",
        "pName": "宁夏",
        "Cities": [
            {
                "cId": "195",
                "cName": "银川市",
                "Dealers": [
                    {
                        "dName": "宁夏润众汽车销售服务有限公司",
                        "dCode": "158"
                    },
                    {
                        "dName": "宁夏润之星汽车销售服务有限公司",
                        "dCode": "707"
                    },
                    {
                        "dName": "宁夏润之杰汽车销售服务有限责任公司",
                        "dCode": "708"
                    }
                ]
            },
            {
                "cId": "303",
                "cName": "石嘴山市",
                "Dealers": [
                    {
                        "dName": "石嘴山市朗宁汽车销售服务有限责任公司",
                        "dCode": "756"
                    }
                ]
            },
            {
                "cId": "312",
                "cName": "吴忠市",
                "Dealers": [
                    {
                        "dName": "吴忠市润众汽车销售服务有限公司",
                        "dCode": "787"
                    }
                ]
            }
        ]
    },
    {
        "pId": "14",
        "pName": "江西",
        "Cities": [
            {
                "cId": "109",
                "cName": "南昌市",
                "Dealers": [
                    {
                        "dName": "江西协众汽车发展有限公司",
                        "dCode": "163"
                    },
                    {
                        "dName": "南昌欧亚汽车销售有限公司",
                        "dCode": "164"
                    },
                    {
                        "dName": "江西华宏名众汽车有限公司",
                        "dCode": "623"
                    }
                ]
            },
            {
                "cId": "110",
                "cName": "九江市",
                "Dealers": [
                    {
                        "dName": "九江宏达汽车贸易有限公司",
                        "dCode": "165"
                    }
                ]
            },
            {
                "cId": "107",
                "cName": "宜春市",
                "Dealers": [
                    {
                        "dName": "江西佳辉汽车贸易服务有限公司",
                        "dCode": "166"
                    }
                ]
            },
            {
                "cId": "111",
                "cName": "萍乡市",
                "Dealers": [
                    {
                        "dName": "萍乡市永安实业有限公司",
                        "dCode": "168"
                    }
                ]
            },
            {
                "cId": "108",
                "cName": "上饶市",
                "Dealers": [
                    {
                        "dName": "上饶市欧亚汽车销售有限公司",
                        "dCode": "441"
                    }
                ]
            },
            {
                "cId": "216",
                "cName": "赣州市",
                "Dealers": [
                    {
                        "dName": "赣州金涛汽车销售服务有限公司",
                        "dCode": "482"
                    },
                    {
                        "dName": "赣州欧亚汽车销售有限公司",
                        "dCode": "642"
                    }
                ]
            },
            {
                "cId": "267",
                "cName": "吉安市",
                "Dealers": [
                    {
                        "dName": "吉安欧亚汽车销售有限公司",
                        "dCode": "611"
                    }
                ]
            },
            {
                "cId": "321",
                "cName": "景德镇市",
                "Dealers": [
                    {
                        "dName": "景德镇欧亚汽车销售有限公司",
                        "dCode": "811"
                    }
                ]
            }
        ]
    },
    {
        "pId": "11",
        "pName": "湖北",
        "Cities": [
            {
                "cId": "81",
                "cName": "武汉市",
                "Dealers": [
                    {
                        "dName": "武汉康顺集团汽车贸易有限公司",
                        "dCode": "172"
                    },
                    {
                        "dName": "湖北东富汽车工贸有限公司",
                        "dCode": "173"
                    },
                    {
                        "dName": "武汉一通汽车销售服务有限公司",
                        "dCode": "270"
                    },
                    {
                        "dName": "武汉东富优诚汽车销售服务有限公司",
                        "dCode": "32"
                    },
                    {
                        "dName": "武汉富尔汽车销售服务有限公司",
                        "dCode": "632"
                    },
                    {
                        "dName": "武汉恒信众联汽车销售服务有限公司",
                        "dCode": "773"
                    }
                ]
            },
            {
                "cId": "82",
                "cName": "黄石市",
                "Dealers": [
                    {
                        "dName": "黄石市大桥汽车服务有限公司",
                        "dCode": "380"
                    }
                ]
            },
            {
                "cId": "84",
                "cName": "宜昌市",
                "Dealers": [
                    {
                        "dName": "宜昌德顺汽车销售服务有限公司",
                        "dCode": "455"
                    },
                    {
                        "dName": "宜昌都顺汽车贸易有限公司",
                        "dCode": "852"
                    }
                ]
            },
            {
                "cId": "222",
                "cName": "荆州市",
                "Dealers": [
                    {
                        "dName": "荆州市恒信一路汽车销售服务有限公司",
                        "dCode": "490"
                    }
                ]
            },
            {
                "cId": "228",
                "cName": "孝感",
                "Dealers": [
                    {
                        "dName": "孝感国富汽车销售服务有限公司",
                        "dCode": "506"
                    }
                ]
            },
            {
                "cId": "230",
                "cName": "十堰",
                "Dealers": [
                    {
                        "dName": "湖北十堰东富汽车销售服务有限公司",
                        "dCode": "525"
                    }
                ]
            },
            {
                "cId": "248",
                "cName": "恩施市",
                "Dealers": [
                    {
                        "dName": "恩施恒信众联汽车销售服务有限公司",
                        "dCode": "581"
                    }
                ]
            },
            {
                "cId": "83",
                "cName": "襄樊市",
                "Dealers": [
                    {
                        "dName": "襄阳华骏汽车销售服务有限公司",
                        "dCode": "587"
                    }
                ]
            },
            {
                "cId": "262",
                "cName": "咸宁市",
                "Dealers": [
                    {
                        "dName": "咸宁恒信众联汽车销售服务有限公司",
                        "dCode": "588"
                    }
                ]
            },
            {
                "cId": "270",
                "cName": "荆门市",
                "Dealers": [
                    {
                        "dName": "荆门恒信众联汽车销售服务有限公司",
                        "dCode": "615"
                    }
                ]
            },
            {
                "cId": "273",
                "cName": "黄冈市",
                "Dealers": [
                    {
                        "dName": "黄冈恒信众联汽车销售服务有限公司",
                        "dCode": "628"
                    }
                ]
            },
            {
                "cId": "290",
                "cName": "襄阳市",
                "Dealers": [
                    {
                        "dName": "襄阳恒信众联汽车销售服务有限公司",
                        "dCode": "677"
                    }
                ]
            }
        ]
    },
    {
        "pId": "10",
        "pName": "湖南",
        "Cities": [
            {
                "cId": "73",
                "cName": "长沙市",
                "Dealers": [
                    {
                        "dName": "湖南汽车城永通有限公司",
                        "dCode": "177"
                    },
                    {
                        "dName": "湖南华洋汽车贸易有限公司",
                        "dCode": "179"
                    },
                    {
                        "dName": "湖南中拓瑞众汽车销售服务有限公司",
                        "dCode": "518"
                    },
                    {
                        "dName": "湖南永通汽车销售服务有限公司",
                        "dCode": "782"
                    },
                    {
                        "dName": "湖南华洋众广汽车销售服务有限公司",
                        "dCode": "812"
                    },
                    {
                        "dName": "浏阳永通汽车销售服务有限公司",
                        "dCode": "858"
                    }
                ]
            },
            {
                "cId": "76",
                "cName": "株洲市",
                "Dealers": [
                    {
                        "dName": "株洲蓝马汽车销售服务有限公司",
                        "dCode": "178"
                    },
                    {
                        "dName": "株洲市健车行汽车服务有限公司",
                        "dCode": "813"
                    }
                ]
            },
            {
                "cId": "72",
                "cName": "常德市",
                "Dealers": [
                    {
                        "dName": "常德裕安贸易有限公司",
                        "dCode": "180"
                    }
                ]
            },
            {
                "cId": "78",
                "cName": "衡阳市",
                "Dealers": [
                    {
                        "dName": "衡阳市西城汽车经贸有限公司",
                        "dCode": "181"
                    }
                ]
            },
            {
                "cId": "77",
                "cName": "湘潭市",
                "Dealers": [
                    {
                        "dName": "湘潭市健车行汽车服务有限公司",
                        "dCode": "183"
                    },
                    {
                        "dName": "湘潭东富汽车销售服务有限公司",
                        "dCode": "706"
                    }
                ]
            },
            {
                "cId": "74",
                "cName": "邵阳市",
                "Dealers": [
                    {
                        "dName": "邵阳市宝庆汽车超市有限公司",
                        "dCode": "208"
                    }
                ]
            },
            {
                "cId": "79",
                "cName": "岳阳市",
                "Dealers": [
                    {
                        "dName": "湖南邦田汽车服务有限公司",
                        "dCode": "280"
                    },
                    {
                        "dName": "平江县邦田汽车服务有限公司",
                        "dCode": "891"
                    }
                ]
            },
            {
                "cId": "227",
                "cName": "永州市",
                "Dealers": [
                    {
                        "dName": "湖南省永州市永恒汽车贸易有限公司",
                        "dCode": "512"
                    }
                ]
            },
            {
                "cId": "225",
                "cName": "娄底市",
                "Dealers": [
                    {
                        "dName": "娄底大汉汽车贸易有限公司",
                        "dCode": "531"
                    }
                ]
            },
            {
                "cId": "275",
                "cName": "怀化市",
                "Dealers": [
                    {
                        "dName": "怀化春茂汽车销售服务有限公司",
                        "dCode": "633"
                    }
                ]
            },
            {
                "cId": "282",
                "cName": "益阳市",
                "Dealers": [
                    {
                        "dName": "益阳永通汽车销售服务有限公司",
                        "dCode": "657"
                    }
                ]
            },
            {
                "cId": "80",
                "cName": "郴州市",
                "Dealers": [
                    {
                        "dName": "郴州永通汽车销售服务有限公司",
                        "dCode": "723"
                    }
                ]
            },
            {
                "cId": "334",
                "cName": "张家界市",
                "Dealers": [
                    {
                        "dName": "张家界永通汽车销售服务有限公司",
                        "dCode": "855"
                    }
                ]
            },
            {
                "cId": "345",
                "cName": "吉首市",
                "Dealers": [
                    {
                        "dName": "湘西永通汽车销售服务有限公司",
                        "dCode": "864"
                    }
                ]
            }
        ]
    },
    {
        "pId": "25",
        "pName": "天津",
        "Cities": [
            {
                "cId": "166",
                "cName": "天津市",
                "Dealers": [
                    {
                        "dName": "天津浩众汽车贸易服务有限公司",
                        "dCode": "200"
                    },
                    {
                        "dName": "天津捷通汽车销售有限公司",
                        "dCode": "201"
                    },
                    {
                        "dName": "天津捷拓汽车销售服务有限公司",
                        "dCode": "202"
                    },
                    {
                        "dName": "天津市捷世通汽车贸易有限公司",
                        "dCode": "279"
                    },
                    {
                        "dName": "天津市捷兴汽车商贸有限公司",
                        "dCode": "450"
                    },
                    {
                        "dName": "天津捷众汽车销售有限公司",
                        "dCode": "532"
                    },
                    {
                        "dName": "天津诚信通汽车销售有限公司",
                        "dCode": "597"
                    },
                    {
                        "dName": "天津庞大一众汽车销售服务有限公司",
                        "dCode": "630"
                    },
                    {
                        "dName": "天津捷锐汽车销售有限公司",
                        "dCode": "732"
                    },
                    {
                        "dName": "天津市捷茂通汽车销售有限公司",
                        "dCode": "74"
                    },
                    {
                        "dName": "天津海联力通汽车销售服务有限公司",
                        "dCode": "790"
                    },
                    {
                        "dName": "天津市澎众汽车贸易服务有限公司",
                        "dCode": "792"
                    },
                    {
                        "dName": "天津华泰通汽车销售有限公司",
                        "dCode": "805"
                    },
                    {
                        "dName": "天津博兴亚泰汽车销售服务有限公司",
                        "dCode": "820"
                    }
                ]
            }
        ]
    },
    {
        "pId": "3",
        "pName": "福建",
        "Cities": [
            {
                "cId": "19",
                "cName": "泉州",
                "Dealers": [
                    {
                        "dName": "泉州盈众汽车销售服务有限公司",
                        "dCode": "205"
                    },
                    {
                        "dName": "泉州大众汽车销售服务有限公司",
                        "dCode": "247"
                    },
                    {
                        "dName": "惠安盈众汽车销售服务有限公司",
                        "dCode": "700"
                    },
                    {
                        "dName": "安溪华迪汽车销售服务有限公司",
                        "dCode": "835"
                    }
                ]
            },
            {
                "cId": "15",
                "cName": "福州市",
                "Dealers": [
                    {
                        "dName": "福建省福京汽车贸易有限公司",
                        "dCode": "245"
                    },
                    {
                        "dName": "福州永力通汽车贸易有限公司",
                        "dCode": "246"
                    },
                    {
                        "dName": "福州盈众汽车有限公司",
                        "dCode": "443"
                    },
                    {
                        "dName": "福建永通达汽车贸易有限公司",
                        "dCode": "724"
                    }
                ]
            },
            {
                "cId": "20",
                "cName": "厦门市",
                "Dealers": [
                    {
                        "dName": "厦门市盈众汽车销售有限公司",
                        "dCode": "299"
                    },
                    {
                        "dName": "厦门致远汽车有限公司",
                        "dCode": "461"
                    },
                    {
                        "dName": "厦门君达汽车有限公司",
                        "dCode": "552"
                    },
                    {
                        "dName": "厦门明至汽车有限公司",
                        "dCode": "776"
                    }
                ]
            },
            {
                "cId": "17",
                "cName": "龙岩市",
                "Dealers": [
                    {
                        "dName": "龙岩市众邦汽车贸易有限公司",
                        "dCode": "410"
                    },
                    {
                        "dName": "龙岩盈众汽车有限公司",
                        "dCode": "725"
                    }
                ]
            },
            {
                "cId": "18",
                "cName": "莆田市",
                "Dealers": [
                    {
                        "dName": "莆田市奇奇贸易发展有限公司",
                        "dCode": "422"
                    }
                ]
            },
            {
                "cId": "22",
                "cName": "三明市",
                "Dealers": [
                    {
                        "dName": "三明盈众汽车有限公司",
                        "dCode": "460"
                    }
                ]
            },
            {
                "cId": "234",
                "cName": "福清",
                "Dealers": [
                    {
                        "dName": "福州致远汽车销售服务有限公司",
                        "dCode": "549"
                    }
                ]
            },
            {
                "cId": "23",
                "cName": "南平市",
                "Dealers": [
                    {
                        "dName": "南平盈众汽车有限公司",
                        "dCode": "550"
                    }
                ]
            },
            {
                "cId": "235",
                "cName": "宁德",
                "Dealers": [
                    {
                        "dName": "宁德盈众汽车有限公司",
                        "dCode": "551"
                    }
                ]
            },
            {
                "cId": "21",
                "cName": "漳州市",
                "Dealers": [
                    {
                        "dName": "漳州致远汽车有限公司",
                        "dCode": "683"
                    },
                    {
                        "dName": "漳州盈众汽车销售服务有限公司",
                        "dCode": "85"
                    }
                ]
            },
            {
                "cId": "16",
                "cName": "晋江市",
                "Dealers": [
                    {
                        "dName": "晋江市金阳汽车销售有限公司",
                        "dCode": "86"
                    }
                ]
            }
        ]
    },
    {
        "pId": "12",
        "pName": "吉林",
        "Cities": [
            {
                "cId": "85",
                "cName": "长春市",
                "Dealers": [
                    {
                        "dName": "长春汇腾汽车销售服务有限公司",
                        "dCode": "219"
                    },
                    {
                        "dName": "吉林省华之诚汽车销售服务有限公司",
                        "dCode": "220"
                    },
                    {
                        "dName": "长春通立汽车商贸有限公司",
                        "dCode": "23"
                    },
                    {
                        "dName": "吉林省吉刚汽车贸易有限公司",
                        "dCode": "24"
                    },
                    {
                        "dName": "长春市华阳汽车贸易有限责任公司",
                        "dCode": "25"
                    },
                    {
                        "dName": "长春瑞骐汽车销售服务有限公司",
                        "dCode": "478"
                    },
                    {
                        "dName": "长春禾根汽车销售有限公司",
                        "dCode": "599"
                    },
                    {
                        "dName": "长春一汽实业众捷汽车销售有限公司",
                        "dCode": "621"
                    },
                    {
                        "dName": "吉林省久恒汽车销售服务有限公司",
                        "dCode": "622"
                    },
                    {
                        "dName": "长春通立德众汽车服务有限公司",
                        "dCode": "65"
                    },
                    {
                        "dName": "吉林省华之诚世达汽车销售服务有限公司",
                        "dCode": "713"
                    },
                    {
                        "dName": "吉林省驰恒汽车销售服务有限公司",
                        "dCode": "718"
                    }
                ]
            },
            {
                "cId": "87",
                "cName": "吉林市",
                "Dealers": [
                    {
                        "dName": "吉林市神华大众汽车服务有限责任公司",
                        "dCode": "221"
                    },
                    {
                        "dName": "吉林市神洲大众汽车销售服务有限公司",
                        "dCode": "562"
                    }
                ]
            },
            {
                "cId": "88",
                "cName": "通化市",
                "Dealers": [
                    {
                        "dName": "通化鑫宇汽车销售有限公司",
                        "dCode": "222"
                    }
                ]
            },
            {
                "cId": "89",
                "cName": "延吉市",
                "Dealers": [
                    {
                        "dName": "延吉中诚汽车贸易有限公司",
                        "dCode": "26"
                    }
                ]
            },
            {
                "cId": "90",
                "cName": "白山市",
                "Dealers": [
                    {
                        "dName": "白山市众合汽车销售维修有限公司",
                        "dCode": "27"
                    }
                ]
            },
            {
                "cId": "86",
                "cName": "松原市",
                "Dealers": [
                    {
                        "dName": "吉林石油装备汽车销售维修服务有限公司",
                        "dCode": "28"
                    },
                    {
                        "dName": "松原汇众汽车销售服务有限公司",
                        "dCode": "711"
                    }
                ]
            },
            {
                "cId": "229",
                "cName": "四平",
                "Dealers": [
                    {
                        "dName": "四平汇众汽车销售服务有限公司",
                        "dCode": "520"
                    }
                ]
            },
            {
                "cId": "337",
                "cName": "白城市",
                "Dealers": [
                    {
                        "dName": "白城汇众汽车销售服务有限公司",
                        "dCode": "896"
                    }
                ]
            }
        ]
    },
    {
        "pId": "27",
        "pName": "浙江",
        "Cities": [
            {
                "cId": "179",
                "cName": "绍兴市",
                "Dealers": [
                    {
                        "dName": "新昌县越达汽车有限公司",
                        "dCode": "22"
                    },
                    {
                        "dName": "绍兴清风汽车销售服务有限公司",
                        "dCode": "243"
                    },
                    {
                        "dName": "绍兴市汇丰汽车销售服务有限公司",
                        "dCode": "486"
                    },
                    {
                        "dName": "嵊州市龙骏汽车销售服务有限公司",
                        "dCode": "746"
                    }
                ]
            },
            {
                "cId": "174",
                "cName": "杭州市",
                "Dealers": [
                    {
                        "dName": "浙江元通宝通汽车有限公司",
                        "dCode": "236"
                    },
                    {
                        "dName": "杭州百年汽车销售服务有限公司",
                        "dCode": "467"
                    },
                    {
                        "dName": "杭州百瑞汽车有限公司",
                        "dCode": "576"
                    },
                    {
                        "dName": "杭州宝通汽车有限公司",
                        "dCode": "649"
                    },
                    {
                        "dName": "临安元通宝通汽车有限公司",
                        "dCode": "694"
                    },
                    {
                        "dName": "浙江一汽汽车销售服务有限公司",
                        "dCode": "70"
                    },
                    {
                        "dName": "桐庐元通汽车有限公司",
                        "dCode": "806"
                    },
                    {
                        "dName": "浙江省直汽车销售服务有限公司",
                        "dCode": "83"
                    }
                ]
            },
            {
                "cId": "180",
                "cName": "宁波市",
                "Dealers": [
                    {
                        "dName": "宁波市康发汽车销售服务有限公司",
                        "dCode": "238"
                    },
                    {
                        "dName": "宁波宝通汽车有限公司",
                        "dCode": "239"
                    },
                    {
                        "dName": "宁波中基甬耀汽车销售服务有限公司",
                        "dCode": "497"
                    },
                    {
                        "dName": "象山华恒汽车销售服务有限公司",
                        "dCode": "661"
                    },
                    {
                        "dName": "宁波联合汽车销售服务有限公司",
                        "dCode": "72"
                    },
                    {
                        "dName": "宁波明众汽车销售服务有限公司",
                        "dCode": "737"
                    },
                    {
                        "dName": "奉化轿辰康发汽车销售服务有限公司",
                        "dCode": "844"
                    },
                    {
                        "dName": "宁波轿辰康嘉汽车销售服务有限公司",
                        "dCode": "872"
                    },
                    {
                        "dName": "慈溪市锦星汽车销售服务有限公司",
                        "dCode": "873"
                    }
                ]
            },
            {
                "cId": "177",
                "cName": "温州市",
                "Dealers": [
                    {
                        "dName": "温州华科欧龙汽车销售服务有限公司",
                        "dCode": "240"
                    },
                    {
                        "dName": "温州市宝捷汽车销售有限公司",
                        "dCode": "381"
                    },
                    {
                        "dName": "温州市瓯海荣新汽车修配有限公司",
                        "dCode": "71"
                    },
                    {
                        "dName": "苍南轿辰康发汽车销售服务有限公司",
                        "dCode": "712"
                    },
                    {
                        "dName": "温州国瑞汽车销售服务有限公司",
                        "dCode": "783"
                    }
                ]
            },
            {
                "cId": "170",
                "cName": "金华市",
                "Dealers": [
                    {
                        "dName": "金华金奥汽车销售服务有限公司",
                        "dCode": "241"
                    },
                    {
                        "dName": "金华宝通汽车有限公司",
                        "dCode": "660"
                    },
                    {
                        "dName": "永康市华奥汽车销售服务有限公司",
                        "dCode": "731"
                    }
                ]
            },
            {
                "cId": "181",
                "cName": "嘉兴市",
                "Dealers": [
                    {
                        "dName": "嘉兴市北方汽车贸易有限公司",
                        "dCode": "242"
                    }
                ]
            },
            {
                "cId": "208",
                "cName": "海门市",
                "Dealers": [
                    {
                        "dName": "海门常和大众汽车销售服务有限公司",
                        "dCode": "447"
                    }
                ]
            },
            {
                "cId": "212",
                "cName": "温岭市",
                "Dealers": [
                    {
                        "dName": "温岭市金桥汽车销售服务有限公司",
                        "dCode": "462"
                    }
                ]
            },
            {
                "cId": "231",
                "cName": "上虞",
                "Dealers": [
                    {
                        "dName": "上虞清风汽车销售服务有限公司",
                        "dCode": "530"
                    }
                ]
            },
            {
                "cId": "182",
                "cName": "湖州市",
                "Dealers": [
                    {
                        "dName": "湖州众腾汽车销售服务有限公司",
                        "dCode": "577"
                    },
                    {
                        "dName": "湖州长运汽车销售服务有限公司",
                        "dCode": "81"
                    },
                    {
                        "dName": "长兴元通汽车有限公司",
                        "dCode": "862"
                    }
                ]
            },
            {
                "cId": "247",
                "cName": "衢州",
                "Dealers": [
                    {
                        "dName": "衢州祥龙汽车有限公司",
                        "dCode": "578"
                    },
                    {
                        "dName": "江山祥宇汽车有限公司",
                        "dCode": "875"
                    }
                ]
            },
            {
                "cId": "178",
                "cName": "台州市",
                "Dealers": [
                    {
                        "dName": "台州市汇腾汽车销售服务有限公司",
                        "dCode": "579"
                    },
                    {
                        "dName": "台州轿辰康发汽车销售服务有限公司",
                        "dCode": "656"
                    },
                    {
                        "dName": "台州金桥汽车销售服务有限公司",
                        "dCode": "76"
                    }
                ]
            },
            {
                "cId": "232",
                "cName": "桐乡",
                "Dealers": [
                    {
                        "dName": "桐乡博众汽车销售有限公司",
                        "dCode": "580"
                    }
                ]
            },
            {
                "cId": "255",
                "cName": "舟山市",
                "Dealers": [
                    {
                        "dName": "舟山市霁锐汽车销售服务有限公司",
                        "dCode": "596"
                    }
                ]
            },
            {
                "cId": "250",
                "cName": "海宁市",
                "Dealers": [
                    {
                        "dName": "海宁市群英汽车销售服务有限公司",
                        "dCode": "602"
                    }
                ]
            },
            {
                "cId": "287",
                "cName": "东阳市",
                "Dealers": [
                    {
                        "dName": "东阳市众富汽车销售服务有限公司",
                        "dCode": "666"
                    }
                ]
            },
            {
                "cId": "171",
                "cName": "瑞安市",
                "Dealers": [
                    {
                        "dName": "瑞安市国荣汽车维修服务有限公司",
                        "dCode": "73"
                    }
                ]
            },
            {
                "cId": "175",
                "cName": "义乌市",
                "Dealers": [
                    {
                        "dName": "义乌市恒通汽车销售服务有限公司",
                        "dCode": "75"
                    }
                ]
            },
            {
                "cId": "168",
                "cName": "慈溪市",
                "Dealers": [
                    {
                        "dName": "慈溪市华泰汽车服务有限公司",
                        "dCode": "77"
                    }
                ]
            },
            {
                "cId": "172",
                "cName": "丽水市",
                "Dealers": [
                    {
                        "dName": "丽水市恒昌汽车有限公司",
                        "dCode": "78"
                    }
                ]
            },
            {
                "cId": "169",
                "cName": "余姚市",
                "Dealers": [
                    {
                        "dName": "余姚宇顺汽车销售服务有限公司",
                        "dCode": "79"
                    }
                ]
            },
            {
                "cId": "173",
                "cName": "诸暨市",
                "Dealers": [
                    {
                        "dName": "诸暨元通汽车有限公司",
                        "dCode": "80"
                    }
                ]
            }
        ]
    },
    {
        "pId": "21",
        "pName": "上海",
        "Cities": [
            {
                "cId": "126",
                "cName": "上海市",
                "Dealers": [
                    {
                        "dName": "上海一汽汽车服务有限公司",
                        "dCode": "248"
                    },
                    {
                        "dName": "上海永达汽车浦东贸易有限公司",
                        "dCode": "249"
                    },
                    {
                        "dName": "上海开隆汽车服务有限公司",
                        "dCode": "250"
                    },
                    {
                        "dName": "上海华星众捷汽车销售有限公司",
                        "dCode": "251"
                    },
                    {
                        "dName": "上海金旋汽车服务有限公司",
                        "dCode": "528"
                    },
                    {
                        "dName": "上海永达豪捷汽车销售服务有限公司",
                        "dCode": "529"
                    },
                    {
                        "dName": "上海虹湾贸易有限公司",
                        "dCode": "593"
                    },
                    {
                        "dName": "上海锦腾汽车销售服务有限公司",
                        "dCode": "594"
                    },
                    {
                        "dName": "上海慕森汽车销售服务有限公司",
                        "dCode": "601"
                    },
                    {
                        "dName": "上海交运起申汽车销售服务有限公司",
                        "dCode": "638"
                    },
                    {
                        "dName": "上海东联北松汽车销售服务有限公司",
                        "dCode": "804"
                    },
                    {
                        "dName": "上海永达众鑫汽车销售服务有限公司",
                        "dCode": "822"
                    },
                    {
                        "dName": "上海嘉安汽车销售有限公司",
                        "dCode": "87"
                    },
                    {
                        "dName": "上海宝乐汽车销售服务有限公司",
                        "dCode": "88"
                    },
                    {
                        "dName": "一汽-大众测试经销商",
                        "dCode": "897"
                    }
                ]
            }
        ]
    },
    {
        "pId": "29",
        "pName": "内蒙古",
        "Cities": [
            {
                "cId": "189",
                "cName": "赤峰市",
                "Dealers": [
                    {
                        "dName": "赤峰凯富达汽车服务有限公司",
                        "dCode": "298"
                    },
                    {
                        "dName": "赤峰隆瑞商贸有限公司",
                        "dCode": "50"
                    },
                    {
                        "dName": "赤峰坤驰汽车销售服务有限公司",
                        "dCode": "771"
                    }
                ]
            },
            {
                "cId": "191",
                "cName": "呼和浩特市",
                "Dealers": [
                    {
                        "dName": "内蒙古亿阳汇众汽车销售有限公司",
                        "dCode": "344"
                    },
                    {
                        "dName": "内蒙古利丰泰宇汽车服务有限公司",
                        "dCode": "453"
                    },
                    {
                        "dName": "内蒙古众和汽车销售服务有限公司",
                        "dCode": "499"
                    },
                    {
                        "dName": "呼和浩特市庞大一众汽车销售服务有限公司",
                        "dCode": "674"
                    }
                ]
            },
            {
                "cId": "190",
                "cName": "鄂尔多斯市",
                "Dealers": [
                    {
                        "dName": "鄂尔多斯市鑫安基业汽车销售有限责任公司",
                        "dCode": "347"
                    },
                    {
                        "dName": "鄂尔多斯市鑫安汽车贸易服务有限责任公司",
                        "dCode": "607"
                    },
                    {
                        "dName": "乌审旗鑫安亿恒汽车销售有限责任公司",
                        "dCode": "750"
                    }
                ]
            },
            {
                "cId": "192",
                "cName": "包头市",
                "Dealers": [
                    {
                        "dName": "包头德众汽车服务有限公司",
                        "dCode": "348"
                    },
                    {
                        "dName": "包头市惠众汽车服务有限公司",
                        "dCode": "631"
                    },
                    {
                        "dName": "包头市东信泰德汽车销售服务有限公司",
                        "dCode": "643"
                    },
                    {
                        "dName": "包头庞大一众汽车销售服务有限公司",
                        "dCode": "668"
                    }
                ]
            },
            {
                "cId": "193",
                "cName": "呼伦贝尔市",
                "Dealers": [
                    {
                        "dName": "呼伦贝尔市华通汽车销售有限公司",
                        "dCode": "45"
                    }
                ]
            },
            {
                "cId": "224",
                "cName": "巴彦淖尔市",
                "Dealers": [
                    {
                        "dName": "巴彦淖尔市航海汽车销售服务有限公司",
                        "dCode": "500"
                    }
                ]
            },
            {
                "cId": "243",
                "cName": "乌海",
                "Dealers": [
                    {
                        "dName": "乌海市鑫安众诚汽贸有限公司",
                        "dCode": "568"
                    }
                ]
            },
            {
                "cId": "254",
                "cName": "锡林浩特",
                "Dealers": [
                    {
                        "dName": "锡林浩特庞大一众汽车销售服务有限公司",
                        "dCode": "584"
                    }
                ]
            },
            {
                "cId": "209",
                "cName": "通辽市",
                "Dealers": [
                    {
                        "dName": "通辽庞大一众汽车销售服务有限公司",
                        "dCode": "586"
                    },
                    {
                        "dName": "通辽市利丰泰宇汽车销售服务有限公司",
                        "dCode": "620"
                    }
                ]
            },
            {
                "cId": "252",
                "cName": "乌兰察布市",
                "Dealers": [
                    {
                        "dName": "乌兰察布市捷通众达汽车销售服务有限公司",
                        "dCode": "600"
                    }
                ]
            },
            {
                "cId": "251",
                "cName": "乌兰浩特市",
                "Dealers": [
                    {
                        "dName": "兴安盟利丰泰宇汽车销售有限公司",
                        "dCode": "603"
                    }
                ]
            }
        ]
    },
    {
        "pId": "31",
        "pName": "海南",
        "Cities": [
            {
                "cId": "196",
                "cName": "海口市",
                "Dealers": [
                    {
                        "dName": "海南博世汽车服务有限公司",
                        "dCode": "412"
                    },
                    {
                        "dName": "海南博众汽车销售有限公司",
                        "dCode": "641"
                    }
                ]
            }
        ]
    }
]